[
 {
   "title": "Customer Service Specialist",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Associate",
   "contractType": "Full-time",
   "workType": "Customer Service",
   "sector": "IT Services and IT Consulting",
   "description": "About the Company\n\nTech Mahindra is an Indian multinational information technology services and consulting company. It was formed in 1986 as a joint venture between Mahindra & Mahindra and BT Group. Part of the Mahindra Group, the company is headquartered in Pune and has its registered office in Mumbai.\n\n\n\n\nAbout the Role\n\n\n\n\nThis is a customer support role wherein the associate will be responsible to resolve the queries of the customer related to the products.\n\n\n\n\n\n\n\nRoles & Responsibilities\n\n\n\n\n * Any Grad/UG+1 Year & Above International voice experience is mandatory on papers.\n * Excellent communication skills is a must.\n * 5 days working.\n * Two way cab facility.\n * Work from Office.\n * Job Location: Hyderabad, Hi-tech City.\n\n\n\n\n\n\nEducational Qualifications\n\n\n\n\n * Any Grad/UG with 1 Year & Above International voice experience(B2C)\n\n\n\n\nRequired Skills\n\n\n\n\n * Excellent communication skills.\n\n\n\n\n\n\nPreferred Skills\n\n\n\n\n• Reviewing account information and answers.\n\n• In Billing (Understanding of recurring bills, Billing cycle Changes, Due date, Prorate charges, Auto-Pay & Surcharges, Service charges, and taxes)\n\n• Experience resolving customer issues in billing,\n\n• Demonstrated communication skills.\n\n• The clarity in thought process (Able to articulate his/ her thought)\n\n• Ability to handle tough situations with customers.\n\n• Strong ability to multitask and take fast decisions independently.\n\n• Willing to work in a 24*7 environment (Rotational shifts/5 Days a week).\n\n• Customer Centric & Logical Thinking & Need to be Enough Spontaneous\n\nEnsure Timely & Professional Responses to all Queries.\n\n\n\n\n\n\n\nPay range and compensation package\n\n\n\n\n5 days a week\n\nTwo way cab facility\n\nWork from Office\n\nSalary : Best as per company norms\n\n\n\n\nEqual Opportunity Statement\n\n\n\n\nInterested candidates may reach out to the below contact person to get your interview aligned.\n\n\n\n\n * HR Rajeshwari: 9963915099\n * HR Mahamuda: 8374503786\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/customer-service-specialist-at-tech-mahindra-4256447763?trk=public_jobs_topcard-title",
   "postedTime": "1 day ago"
 },
 {
   "title": "Senior Business Analyst",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Analyst",
   "sector": "IT Services and IT Consulting",
   "description": "Job Title: Business Analyst - Payments (ISO20022, Cross Border, SWIFT, MT)\n\n\n\n\nExperience: 6+ years\n\nLocation: Bengaluru & Chennai\n\nQualification: Btech+MBA Preferred\n\nNotice Period: 30-40 Days\n\n\n\n\nKey Responsibilities:\n\n\n\n\n1.Gather and document business requirements related to ISO20022, SWIFT (MT messages), and cross-border payments.\n\n2.Work closely with stakeholders to analyze and optimize payment processing systems.\n\n3.Conduct impact assessments and define functional requirements for sanction screening and investigations.\n\n4.Collaborate with development and testing teams to ensure proper implementation of business requirements.\n\n5.Support payment system migration and transformation projects, particularly in ISO20022 adoption.\n\n6.Ensure compliance with global banking standards and regulatory requirements in cross-border transactions.\n\n7.Perform UAT (User Acceptance Testing) and validate system changes before deployment.\n\n\n\n\nKey Skills :\n\n\n\n\n1.Strong experience as a Business Analyst in Retail Global Banking.\n\n2.Expertise in ISO20022, SWIFT (MT messages), and cross-border payment systems.\n\n3.Hands-on experience in sanction screening and investigation processes.\n\n4.Knowledge of payment processing, regulatory compliance, and financial messaging protocols.\n\n5.Excellent analytical and problem-solving skills.\n\n6.Strong communication skills and ability to interact with stakeholders at various levels.\n\n7.Experience working in Agile environments is a plus\n\n8. Immediate joiners will be highly preferred.",
   "jobUrl": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-tech-mahindra-4240882276?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Test Engineer",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Role: IVR Testing\n\nJob Location – Bengaluru, Chennai\n\nExperience– 5-7 Years\n\n\n\n\nJob Description:\n\n\n\n\n * Strong understanding of IVR Application Testing, IVR Performance Testing, Outbound Testing\n * Strong understanding of RESTful and SOAP APIs.\n * Proficiency in Postman, Rest Assured, SoapUI, or similar API testing tools.\n * Experience with API automation using Java.\n * Familiarity with SQL for database validation.\n * Knowledge of API documentation tools like Swagger.\n * Develop, execute, and maintain test cases for RESTful and SOAP APIs.\n * Identify, log, and track defects, collaborating with developers to resolve issues.\n * Create test plans, test cases, test scripts, and test reports.\n * Expert in APIs security standards by testing authentication, authorization, and data protection.\n * Work closely with developers, business analysts, and QA teams to enhance product quality.\n * Hands on experience in UI automation using selenium.\n * Strong understanding of BDD cucumber frameworks\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/test-engineer-at-tech-mahindra-4240894375?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Engineer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n\"Product Design & Development Skills 1. Experience in Design & Development BIW SYSTEMS Closures (Doors, Roof, Bonnet, Tail Gate), Fender, Carrier Systems Front End Carrier, Crash Management System. 2. Very Good Skills in Catia V5 Surface, Solid Modeling & Drafting. , Experience on PLM Connect 3. Experience in Style Surface Feasibility & Analysis i.e. checking Draft, Tooling Feasibility, ECE R26 Regulation Evaluation, creating concept proposals Packaging Study with surrounding parts, Benchmarking Study and Analysis, Joining Processes for Sheet metal parts. 4. Understanding of Sheet metal part Operations Piercing, Blanking, Forming, Drawing, Trimming etc. for tooling feasibility. 5. Should have experience in DFx ( Design for Mfg., assembly & Serviceability) 6. Knowledge in tooling, fixings, Materials, GD & T, Stack up DFMEA, DVP etc. will be preferable Project Co ordination & Communication Skills 1. Should be responsible for Quality, Delivery,Time lines for responsible system. 2. Maintain & support project status & documentation to present in Customer Meetings. 3. Should be able to give advance inputs to Internal teams & Customer to resolve the issues. 4. Strong communication , Presentation & Documentation skills\"\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/engineer-at-tech-mahindra-4244471781?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Pricing roles",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Finance",
   "sector": "IT Services and IT Consulting",
   "description": "• Deal evaluation for IT services involves taking input from multiple teams and translating the same into deal commercials.\n\n• Preparation of a customer pricing presentation sheet, along with listing out key deal commercial terms and conditions.\n\n•Ensuring deal commercials are in alignment with appropriate risk protection against Forex, international taxation, global labor laws (i.e., ARD and TUPE), etc.\n\n• Contract redlining, review, and discussion with the internal team (delivery, legal, business, etc.) and participating in customer negotiations.\n\n•Preparation of deal P&L as per IFRS, deal cash flow, and balance sheet\n\n•Preparation of the deal termination schedule.\n\n•Identifying the accounting treatment of cost items in the deal P&L that is in alignment with accounting standards (GAAP and IFRS)\n\n•Coordinating with multiple internal teams for cost inputs and deal solution discussion.\n\n•Ability to identify commercial and contracting risks in the deal, highlight the same to leadership, and suggest or deploy a mitigation approach.\n\n•Collaborate with other functions of the finance team on reporting and accounting requirements.\n\n•Ability to multitask between priorities to meet all organizational deadlines and quality expectations.\n\n• Interface and coordinate with the development team on system enhancements, responsible for strong internal controls.\n\n\n\nQualification: CA, CWA, MBA with 2-10 years relevant experience\n\n\n\n\nJob locations: Hyderabad, Pune & Delhi NCR (Noida, Gurugram)",
   "jobUrl": "https://in.linkedin.com/jobs/view/pricing-roles-at-tech-mahindra-4248117424?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "Senior Business Analyst",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Analyst",
   "sector": "IT Services and IT Consulting",
   "description": "The ideal candidate will play a role in the development of multiple parts of the business by analyzing past, current, and future business trends. This individual will establish strategies to achieve desired outcomes and implement these strategies. They will often work cross-functionally with internal business units in order to understand the challenges that these teams are face and provide solutions to these groups.\n\n\n\n\nExperience: 6+ Years\n\nJob Location: Bengaluru/ Chennai\n\nNotice Period: 30-40 days\n\n\n\n\nQualifications:\n\n\n\n\n * Work with the business users to capture, analyze and prioritize business requirements in harmony with existing Straight2Bank NextGen cash functionalities.\n * Hands-on experience in requirements life cycle management in banking and financial domain. Should be able to manage requirements from inception to implementation across multiple systems interfaces\n * Sound knowledge on cash management products and services offers, corporate banking channels and industry clearing systems and the different file format utilized by clients for payments.\n * Strong product management skills including product roadmaps, requirements gatherings.\n * Understanding of UX principles and the ability to advocate for a user centric approach to product design and development.\n * Familiarity with metrics and KPIS related to digital channels, including customer satisfaction and adoption stats.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/senior-business-analyst-at-tech-mahindra-4240896470?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Human Resources Intern",
   "companyName": "Tech Mahindra",
   "location": "Noida, Uttar Pradesh, India",
   "experienceLevel": "Internship",
   "contractType": "Internship",
   "workType": "Human Resources, Marketing, and Business Development",
   "sector": "IT Services and IT Consulting, Business Consulting and Services, and Manufacturing",
   "description": "Type of Internship: Unpaid\n\nJoining Date: Only Immediate joiners are required\n\nMode of work: Work from Office only\n\nDuration: 2-6 months\n\n\n\n\nRequired Skill Set\n\nThe Recruiting Intern should possess the following skills, attributes, and qualifications:\n\n• Bachelor’s Degree, preferably in HR or a related field\n\n• Expert computer skills\n\n• Strong administrative and document management skills\n\n• Excellent written and verbal communication\n\n• Willingness to learn\n\n• Ability to multitask and work under deadlines\n\n• Enthusiasm and a capacity for hard work\n\n• Strong interest in recruitment\n\n\n\n\nKey Responsibilities:\n\n• Attend college career fairs, interact with students and promote our employer brand\n\n• Screen resumes, conduct interviews and perform skills assessment tests for junior positions and\n\ninternships\n\n• Report on recruiting metrics after every careers event, including number of candidates\n\ninterviewed and hired\n\n• Advertise current open roles to online and offline alumni communities\n\n• Contact university career counselors and provide informative materials about our internship\n\nprograms\n\n• Post job ads and source potential candidates on social media groups\n\n• Collaborate with team leaders to identify hiring requirements and develop a comprehensive\n\nsourcing plan from start to finish.\n\n• Build and maintain good relationships with universities and other educational institutions",
   "jobUrl": "https://in.linkedin.com/jobs/view/human-resources-intern-at-tech-mahindra-4252133590?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Project Management Officer -PMO",
   "companyName": "Tech Mahindra",
   "location": "Navi Mumbai, Maharashtra, India",
   "experienceLevel": "Associate",
   "contractType": "Full-time",
   "workType": "Project Management",
   "sector": "Software Development, IT System Custom Software Development, and IT Services and IT Consulting",
   "description": "Project Management Officer -PMO\n\nLocation - Belapur/Seawoods, Navi Mumbai\n\nComplete work from office including alternate Saturdays (1st, 3rd & 5th)\n\nAbout the Role\n\n\n\n\nMust Have: 4 years of total experience as PMO. Manage the day-to-day activities of various teams to ensure projects are completed on time and within budget. Project Management Officer/PMO responsibilities include planning project management activities, analyzing financial information to keep projects on track. Collaborating with different departments to ensure all leaders understand where a project is in the development process. Ultimately, you will work with leaders across various departments to help streamline our projects to ensure we reach our goals and keep projects on track for timely completion. Document the project’s creation, development, and execution as well as the project’s scope, budget, and justification. Hands on experience on Project Management, Resource management, various PMO activities.\n\n\n\n\nResponsibilities:\n\n * Attendance, Timesheet, and Invoice related\n * Attendance & Timesheet submission with client\n * Obtaining approvals, preparing RUS\n * Working close with internal PMO & CPMO teams\n * Resource Onboarding\n * Resource allocation & deallocation, SO/DM creation, tracking & monitoring\n * Working closely with RMG/TAG/HR team for tracking SO/DM and for onboarding\n * Work in close coordination with PMs, Leads and the newly onboarded resources in ensuring their utilization\n * Work with client and the associate in ensuring onboarding formalities as expected by client finalized processes\n * Meticulous traction to be established between the resource, TL, PM and client onboarding team\n * Other internal responsibilities\n * Collate and keep a repository of various data handy for reference / review\n * Support the PM/PGM in preparing decks for review meetings (internal and with client)\n * Work with the PGM / PMs and plan training / coordinate with relevant stakeholders in planning and execution\n * Support the PGM in tracking the various streams / activities happening in the program\n * Tracking the actions items\n * Preparing reports and dashboard for daily update\n * Monitoring of demands and keep track of critical deliverables\n * Project monitoring activities and reporting to internal & external stakeholders\n * Experience in IT industry is required, exposure to banking is desirable\n\n\n\n\nQualifications\n\n\n\n\n * Education - BE/BTech/MTech/MCA only\n * Experience - 4-8 Years\n\nRequired Skills\n\n\n\n\n * Proven work experience as a Project Management Officer (PMO) or similar role\n * Strong leadership skills\n * Good written and verbal communication skills\n * Strong attention to details and technicalities\n * Excellent organizational and technical abilities\n * Good interpersonal and multi-tasking skills\n * Relevant training and/or certifications as a Project Management Office (PMO)\n\n\n\n\nPreferred Skills\n\n * Experience in IT industry is required, exposure to banking is desirable.",
   "jobUrl": "https://in.linkedin.com/jobs/view/project-management-officer-pmo-at-tech-mahindra-4241204978?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Sr. Associate-Analyst",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Accounting/Auditing, Finance, and Customer Service",
   "sector": "Accounting, Financial Services, and IT Services and IT Consulting",
   "description": "Greeting from Tech Mahindra!\n\n\n\n\nWe are currently looking for Record to Report Specialist to join our internal team here in Hyderabad.\n\n\n\n\nAbout the Company\n\nTech Mahindra is committed to delivering innovative solutions and services to our clients, fostering a culture of collaboration and excellence.\n\n\n\n\nAbout the Role\n\nThe Record to Report Specialist will play a key role in the monthly, quarterly, and annual closing processes related to General Ledger, working closely with global stakeholders to ensure accurate recording and reporting.\n\n\n\n\nResponsibilities\n\n * Active participation in performing the monthly, quarterly and annual closing process related to General ledger.\n * Work closely with the global stakeholders to process and ensure accurate recording (Accruals, Amortization, Allocation, Reclass, etc), reporting, consolidation and analyzing reports pertaining to General ledger accounting.\n * Good understanding of accounting and balance sheet reconciliation.\n * Good Knowledge in Bank statement process as well-Fixed Assets.\n * Research and resolving intercompany discrepancy.\n * Strong initiative ability to work with limited supervision and direction.\n * Ability to identify gaps and ensure checkpoints in the process.\n * Extract, modify and analyze monthly reports as required and resolve queries and complex accounting issues.\n * Team Player: Collaborative mindset to build strong and enduring relationship to work effectively with cross-functional teams.\n * Deadline-Driven: Ability to meet tight reporting deadlines and prioritize tasks.\n * Adaptability: Willingness to adapt to changing business needs and technologies.\n * Manage expectations of his team members and proactively should be able to sense their needs.\n * Problem Solver: Capable of identifying issues timely and proposing solutions.\n * Quick learner: Able to learn and understand end to end GL accounting processes and system for high quality performance.\n * Communication: Transparent communications, and alignment between diverse constituents.\n\n\n\n\nQualifications\n\n * Preferably CMA / MBA / M.com / Semi qualified CA\n\n\n\n\nRequired Skills\n\n * Min. 2 year of experience with GL accounting Process with overall 5 to 8 years of accounting experience.\n * Proficient in MS Excel, PowerPoint, and other MS Office tools.\n * Familiar with accounting and finance practices.\n\n\n\n\nPreferred Skills\n\n * Experience in accounts receivable processes.\n * Familiarity with customer relationship management.\n\n\n\n\nPay range and compensation package\n\nPayroll: Tech Mahindra\n\n\n\n\n\n\n\nShifts: UK Shift (12PM till 9:30 PM || 5 days working || Sat-Sun off)\n\n\n\n\nEqual Opportunity Statement\n\nTech Mahindra is committed to diversity and inclusivity in the workplace.\n\n\n\n\n\n\n\nInterested candidates can share their CV's at CR001059600@Techmahindra.com\n\n\n\n\n\n\n\nCall/WhatsApp HR Hemant on 8520921192 to get your interview aligned!\n\n\n\n\n\n\n\nThanks & Regards,\n\nHemant Rao\n\nHR-TA\n\nTech Mahindra",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-associate-analyst-at-tech-mahindra-4254862732?trk=public_jobs_topcard-title",
   "postedTime": "5 days ago"
 },
 {
   "title": "Legal",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Legal",
   "sector": "IT Services and IT Consulting",
   "description": "Role: Legal\n\nYears of Experience: 12+\n\nLocation: Noida/Pune/Hyderabad/Mumbai/Bangalore\n\n\n\nJD:\n\n * Responsible for drafting, reviewing and vetting of IT, ITES, Technology Contracts , Agreements and legal documentation.\n * Well versed in review and negotiation of Master Service Agreements, EPC, Turnkey contracts, Professional Service Agreements, NDAs, Procurement Agreement.\n * Handling of government tenders, Bid proposals, RFI, RFP,EOIs and experienced in handling contracts with OEMs, Service Providers, Sub Contractors –Software license, Hardware, Cloud, SaaS, AI, Manpower etc.\n * Liaising and making contractual correspondence with Clients and internal stakeholders and working on amendments or extensions of contracts, and compliance to contractual obligations.\n * Responsible to safeguard the interest of Company in contractual matters and responsible for identifying and mitigating risks, liabilities and deviations",
   "jobUrl": "https://in.linkedin.com/jobs/view/legal-at-tech-mahindra-4239057459?trk=public_jobs_topcard-title",
   "postedTime": "4 weeks ago"
 },
 {
   "title": "Associate Business Consultant",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Consulting, Information Technology, and Sales",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nTo manage and contribute towards project delivery and solution design. Analyse new requirements and provide effort estimation Prepare, publish, agree and monitor the project activity and schedule. Perform change impact assessment, stakeholders management. Create future state design independently for the Model Based Solution with pre defined process artifacts. Contribute to Model Based Solution with new solution requirement/domain. Contribute in creation of capability assets independently with pre defined process assets in a known domain. Assist in the sales management by Lead generation and independent follow up. Perform process assessment/audit for a Model Based Solution with pre defined process artifacts. Participate and contribute in internal knowledge sharing sessions and independently contribute to Knowledge Repository.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/associate-business-consultant-at-tech-mahindra-4240916779?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Ad ops Team leader",
   "companyName": "Tech Mahindra",
   "location": "Greater Bengaluru Area",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Customer Service, Management, and Strategy/Planning",
   "sector": "IT Services and IT Consulting, Business Consulting and Services, and Professional Training and Coaching",
   "description": "Roles: Team Leader - Ad Ops\n\nBand: U3\n\nLocation: Bangalore Electronic City Office Phase 2\n\n\n\n\nJob Description:\n\n * Build solid relationships with advertisers, displaying a dedication to delivering first-class service and advertising solutions\n * Flawlessly execute end-to-end campaigns, liaising with advertisers.\n * Should have experience in ecommerce, D2C, marketplace, PPC, Performance Advertising, Performance Marketing, PPC Agency, Google Pre.\n * Analyze campaign performance against key metrics to identify, recommend, and implement optimizations to increase efficiency, drive high renewal rate and meet advertisers KPIs\n * Monitor and communicate campaign progress through regular, in-depth activity reports and insights, using this knowledge as a basis for future campaigns\n * Track & Own the Ad Revenue goals shared by Business for the bucket/set of advertisers being managed and deploy different ad-product strategies\n * Leverage our suite of rich data, targeting and product channels to collaborate with the other teams in the development of tailored solutions that meet clients’ goals\n * Troubleshoot any technical or implementation issues, collaborating with internal teams to develop quick and sound solutions\n * Serve as a source of market intelligence for other areas of the Advertising team (e.g., product development, product marketing, pricing) and assist in the development of best practices and operational efficiencies\n * Co-lead monthly and quarterly reviews with advertisers\n * Drive operational excellence to ensure SLA adherence and client satisfaction\n * Billing and resolution of any financial issues\n * Resolution of any financial issues faced by advertiser and escalate un-resolved issues.\n\n\n\nBasic Qualifications\n\n * Graduation Mandatory\n * Proven experience (6+ years) in ad operations, online marketing or programmatic advertising\n * 2+ years working in an external client facing environment\n * Creative and strategic vision to build value proposition for clients and property\n * Strong analytical skills as well as experience in applying those skills in the advertising domain\n * Ability to work cross-functionally and with a wide range of employees with different skill sets\n * Ability to aggregate and analyze internal and external campaign metrics to assess performance drivers and identify insights\n * Sound judgment and flexibility in balancing program requirements, tight deadlines, and keeping people and projects moving on schedule\n * Media planning & story-telling capabilities\n\n\n\n\nPlease mail Barkha at bv00792989@techmahindra.com to know more about this role.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/ad-ops-team-leader-at-tech-mahindra-4249165019?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "Engineer",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nAbility to perform Authoring in S1000D standards based on the input received for all Airbus programs Ability to create illustration mockups Mechanical & Electrical by studying the inputs Ability to understand aircraft manuals like IPC, AMM, AWL ASM and SRM Good Knowledge and interpretation of engineering drawings. Possess good knowledge of Airbus process and standard guides. Must have good oral, written and organizational skills Must have good knowledge on illustration tools like TECH DRAW, Tech Illustrator Must have good knowledge on Arbor text EPIC Editor, SAMM Must have good knowledge Airbus Tools: SAP, GILDA, ZAMIZ, Airn@v, CIRCE C , GILDA ETC., Relevant Experience Preferred\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/engineer-at-tech-mahindra-4250894100?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "System Engineer",
   "companyName": "Tech Mahindra",
   "location": "Mumbai Metropolitan Region",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n¿ Providing out of hours cover as agreed with the Team Leader ¿ Ensuring consistency across staging/production and Disaster recovery systems as defined in SLA for each setup. ¿ Escalating hardware and system level problems to AMC Vendors. ¿ Quarterly patching and firmware activity on RHEL servers. ¿ Configure, Control and Monitor all RHEL and IBM servers through console ¿ Attending Hardware failures. Disks, Memory, Power supply, etc. ¿ Performing filesystem management like Mirroring, striping through LVM. ¿ Attending Software Issues. OS level problems, SSH problems. ¿ Providing CPU, Memory and core utilization of servers on daily basis. ¿ Performing log movement as per bank policy and managing log movement inventory ¿ Working on the requests of development and support team on staging and UAT setup ¿ Hardening of servers as per bank policy ¿ User administration of all servers ¿ Monitoring operating system utilization patterns and preparing reports. ¿ Should perform DNS or host entry and as per the customer request. ¿ Monitoring servers for hardware errors like hard disk, RAM, CPU failures/warnings, notifying appropriate service providers, and working on the same until closure. ¿ Monitoring DC and DR SRM (Site Recovery Manager) sync status ¿ Interface proactively with other Infrastructure support teams such as Database, Network, Storage, Monitoring etc. ¿ Document issues and associated resolutions to problems ¿ Prepare documentation and presentation of progress reports to customers\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/system-engineer-at-tech-mahindra-4247533805?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Python Developer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "General Business",
   "sector": "IT Services and IT Consulting",
   "description": "Python Developer\n\n✅ Must-Have Skills\n\nExperience- 5 Yrs\n\nLocation: Pune\n\n * Core Python: OOP, decorators, context managers, comprehensions, generators, lambda, async, regex, standard libraries.\n * Frameworks: Flask, Django, or FastAPI.\n * ORM: SQLAlchemy.\n * Data Engineering: Pandas, NumPy, Spark or Dask.\n * ML Frameworks: PyTorch, Scikit-learn, or TensorFlow.\n * Testing: Pytest, Unittest, Nose2, Robot, Selenium, etc.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/python-developer-at-tech-mahindra-4252126741?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Account Manager",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Sales and Business Development",
   "sector": "IT Services and IT Consulting",
   "description": "Responsibilities -\n\n * Client relationship management and business development: manage client relationships, manage & build a multi-million dollar portfolio, own the opportunity management cycle: Prospect-Evaluate-Propose-Close\n * Client delivery assurance: collaborate with all delivery stakeholders involved to ensure fulfillment of all commitments to the client\n * Account planning and governance: create the account plan including relationships required, opportunities to be pursued, price decisions, etc.\n\n\n\n\nRequired Skills:\n\n * Experience in opening new logos and should have good relationships preferably C-level/Senior executives within the Telecom / Teleco industry\n * Exposed to / involved in “new age” service providers\n * Has a solid sales and business development experience of similar size and scope\n * Knowledge of industry-specific go-to-market solutions is a plus\n * Track record of interacting and building relationships with CxO-level client contacts\n * Global Delivery Model Experience desirable\n * Experience managing large multi-location consulting engagement teams desirable\n * Track record as Business Development/Practice Development Executive in a rapidly growing client relationship required.\n * Hands-on experience with proposal creation and leading proposal presentations.\n * Strong leadership, interpersonal, communication, and presentation skills.",
   "jobUrl": "https://in.linkedin.com/jobs/view/account-manager-at-tech-mahindra-4256434691?trk=public_jobs_topcard-title",
   "postedTime": "1 day ago"
 },
 {
   "title": "Team Lead- BPO",
   "companyName": "Tech Mahindra",
   "location": "Mumbai, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Customer Service",
   "sector": "IT Services and IT Consulting",
   "description": "Tech Mahindra is hiring for the role of Team Leader- BPO with minimum 1 year of experience for Airoli and Chandivali Mumbai. The requirements are\n\nHands on experience in managing and calculating occupancy, shrinkage, Attrition, bottom quartile\n\nKRA and KPI of TL\n\nRoster planning\n\nExcel\n\nProductivity, AHT, Quality\n\n\n\n\nThe max budget for the role is 5.5LPA.\n\n\n\n\nIf Interested share your CVs on WhatsApp to 8092538712\n\nExperience-\n\nCurrent CTC\n\nExpected CTC\n\nNotice period\n\n\n\n\nImmediate joiners preferred\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/team-lead-bpo-at-tech-mahindra-4250342713?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Quality Auditor-BPO, Hyderabad",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Associate",
   "contractType": "Full-time",
   "workType": "Customer Service",
   "sector": "IT Services and IT Consulting",
   "description": "We are hiring for the role of Quality Auditor- BPO with minimum 1 year of experience in Hyderabad-Hi-Tech City\n\n\n\nLooking for someone with knowledge on:\n\n 1. KRA and KPIs of QA\n 2. 7QC Tools\n 3. Fatal/non Fatal errors\n 4. Call Calibration\n 5. Dip Check and quality related framework\n 6. Dip check and BQ Improvement\n 7. PIP Management\n\n\n\nThe max budget for the role is 4LPA\n\n\n\n\nShifts- rotational\n\n5 days working\n\n\n\nIf Interested share your CVs with below mentioned details to WhatsApp on 8092538712\n\n 1. Experience-\n 2. Current CTC\n 3. Expected CTC\n 4. Notice period\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/quality-auditor-bpo-hyderabad-at-tech-mahindra-4250344360?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "UX Designer --  Bangalore / Pune/ Hyderabad / Chennai -- Immediate to 15 days NP",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Design",
   "sector": "IT Services and IT Consulting",
   "description": "Greetings from Tech Mahindra Ltd !!!\n\n\n\n\nGrab your dream opportunity & bring value to the organization !!!\n\n\n\n\nJob Role : UX Designer\n\n\n\n\nExp – 6-12 Years\n\n\n\n\n * Overall experience of 6+ years in UX designer\n * Strong experience on Figma tool\n * UX Researcher experience\n * Excellent communication\n\nLocation : Bangalore / Pune / Chennai/ Hyderabad\n\n\n\n\nPlease share your updated profile with below details ::\n\n\n\n\nTotal Experience –\n\nUX Designer –\n\nUX Researcher -\n\nFigma -\n\nCurrent CTC –\n\nExpected CTC –\n\nNotice period – Need immediate to 15 days only\n\nCurrent location –\n\nPreferred location –\n\n\n\n\n\n\n\nRegards,\n\nPoonam\n\nTech Mahindra Ltd (Talent Acquisition)",
   "jobUrl": "https://in.linkedin.com/jobs/view/ux-designer-bangalore-pune-hyderabad-chennai-immediate-to-15-days-np-at-tech-mahindra-4249164096?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "Quality Auditor-BPO",
   "companyName": "Tech Mahindra",
   "location": "Mumbai, Maharashtra, India",
   "experienceLevel": "Associate",
   "contractType": "Full-time",
   "workType": "Customer Service",
   "sector": "IT Services and IT Consulting",
   "description": "We are hiring for the role of Quality Auditor- BPO with minimum 1 year of experience in Airoli, Mumbai\n\n\n\nLooking for someone with knowledge on:\n\n 1. KRA and KPIs of QA\n 2. 7QC Tools\n 3. Fatal/non Fatal errors\n 4. Call Calibration\n 5. Dip Check and quality related framework\n 6. Dip check and BQ Improvement\n 7. PIP Management\n\n\n\nThe max budget for the role is 5LPA.\n\n\n\nIf Interested share your CVs with below mentioned details on whatsapp to 8092538712",
   "jobUrl": "https://in.linkedin.com/jobs/view/quality-auditor-bpo-at-tech-mahindra-4250343534?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Delivery Lead",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Position: Tech Delivery Lead\n\n\n\n\nLocation: Hyderabad (Onsite relocation to Malaysia)\n\n\n\n\nExperience: 18 - 20 Years\n\n\n\n\nJob Description:\n\nOverall Oracle ERP Implementation Experience - 18-20 years - specialization in Global Rollouts\n\nDelivery Management in Fusion ERP Cloud Implementations Experience - 7-10+ years.\n\nImplemented large global rollout in Asia Pacific Region, Multi Country ERP Transformations.\n\nERP Implementation / Transformation experience in delivery in multi vendor environment, engaging multiple vendors as part of the Implementation.\n\nExpertise in end to end Finance, Tax Transformations, Transition and AMS\n\nEnd to end Delivery & Program Management",
   "jobUrl": "https://in.linkedin.com/jobs/view/delivery-lead-at-tech-mahindra-4241204197?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Cyber Security Consultant",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Part-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "COE-WAF Delivery BA\n\n\n\n\n * Significant experience of managing engagements with multiple project stakeholders and establishing strong working relationships\n * Provide briefings and support to technical teams for meetings with Stakeholders\n * Provide input into weekly/monthly reports for the project boards\n * Proven ability to work and multi-task under pressure, respond quickly to changing situations in a complex project environment\n * Experience in application of Web Application Firewalls, specifically F5 AWAF and F5 NGINX\n * Experience in WAF tuning and move to block process\n * Familiarity with using / application of F5 Load Balancers\n * Familiarity with using / application of IKP – Internal Kubernetes Platform",
   "jobUrl": "https://in.linkedin.com/jobs/view/cyber-security-consultant-at-tech-mahindra-4250387681?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Sr. Engineer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n\"Product Design & Development Skills 1. Should be excellent in Design & Development Closures (Doors, Roof, Bonnet, Tail Gate), Fender, Carrier Systems Front End Carrier, Crash Management System. 2. Experience in Style Surface Feasibility & Analysis i.e. checking Draft, Tooling Feasibility, ECE R26 Regulation Evaluation, creating concept proposals Packaging Study with surrounding parts, Benchmarking Study and Analysis, Joining Processes for Sheet metal parts. 3.Knowledge of Sheet Part Operations Piercing, Blanking, Forming, Drawing, Trimming etc. for tooling feasibility. 4. Should have experience in DFx ( Design for Mfg., assembly & Serviceability) 5. Knowledge in tooling, fixings, Materials, GD & T, Stack up DFMEA, DVP etc. will be preferable 6. Understand CAE, Sheet metal Simulation requirements, Targets and results for project requirements & implementation Project Co ordination & Communication Skills 1. Should be responsible for Quality, Delivery Time lines for responsible system. 2. Maintain project status & documentation to present in Customer Meetings. 3. Should be able to give advance inputs to Internal teams & Customer to resolve the issues. 4. Resolve ambiguity through Technical and Strong communication skills with customer. 5. Strong communication , Presentation & Documentation skills\"\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-engineer-at-tech-mahindra-4203445530?trk=public_jobs_topcard-title",
   "postedTime": "2 months ago"
 },
 {
   "title": "Technical Lead",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": " * Demonstrable ability to write high quality Python/Golang and SQL in a production context. You are happy to learn new programming languages and frameworks as necessary.\n * Experience with large volumes of data and high throughput, low latency solutions built on Kafka and Kubernetes\n * You have experience with, and are interested in, contemporary approaches to service design, including the use of containers and container orchestration technologies, streaming data platforms, APIs, and in-memory/NoSQL stores.\n * You have experience in resolving different solutions and approaches to problems and can choose between pragmatic and rigorous solutions depending on the situation.\n * You are comfortable working in a devops-based software development workflow, including building, testing, and continuous integration/deployment. You are also happy to be evolve along with the development process and contribute to its success.\n * You are comfortable communicating with a range of stakeholders, including subject matter experts, data scientists, software engineers, devops and security professionals.\n * You have the ability to engage with best practices for code review, version control, and change control, balancing the need for a quality codebase with the unique and particular demands of scale-up stage software engineering.\n * You have experience optimising solution performance with a constrained set of technologies.\n * You have experience or are keen to engage with productionising machine learning technologies combined with large scale feature engineering.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/technical-lead-at-tech-mahindra-4251390825?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Sr. Engineer",
   "companyName": "Tech Mahindra",
   "location": "Chennai, Tamil Nadu, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nExcellent in Interior Trim Product Design & Development Cockpit, Pillar Trims, Soft Trims, Headliner, Carpets etc. for passenger vehicles. Experience in Style Surface Feasibility & Analysis i.e. checking Draft, Tooling Feasibility, creating concept proposals Packaging Study surrounding parts, Benchmarking Study & Analysis. Should have experience in DFx ( Design for Mfg., assembly & Serviceability) Knowledge in tooling, fixings, Materials, GD & T, DFMEA, DVP etc. will be preferable.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-engineer-at-tech-mahindra-4235366206?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Product Management",
   "sector": "IT Services and IT Consulting, Banking, and Investment Banking",
   "description": "```html\n\nAbout the Company\n\n\n\n\n\n\n\nWe are looking for a skilled Mainframe Assembler Engineer with expertise in “Connex on IMB Mainframe” and Switch technologies. The ideal candidate will be responsible for developing, maintaining, and optimizing mainframe applications and systems using Assembler language. Additionally, the candidate will leverage their Connex and Switch experience to ensure seamless integration and communication between mainframe systems and modern platforms.\n\n\n\n\n\n\n\nAbout the Role\n\n\n\n\n\n\n\nThe ideal candidate will be responsible for developing, maintaining, and optimizing mainframe applications and systems using Assembler language.\n\n\n\n\n\n\n\nResponsibilities\n\n\n\n\n\n\n\n * Design, code, test, and debug mainframe applications and systems using Assembler language.\n * Collaborate with cross-functional teams to gather requirements and translate them into technical solutions.\n * Enhance and maintain existing mainframe applications to improve performance, reliability, and scalability.\n * Implement “Connex on IBM MF” and Switch configurations to enable secure and efficient communication between mainframe systems and external platforms.\n * Troubleshoot and resolve technical issues related to mainframe applications, Connex, and Switch configurations.\n * Conduct code reviews, performance analysis, and optimization to ensure code quality and system efficiency.\n * Stay updated with industry trends, technologies, and best practices related to mainframe development, Connex, and Switch.\n\n\n\n\n\n\nQualifications\n\n\n\n\n\n\n\n * Bachelor's degree in computer science, Information Technology, or related field.\n * Proven experience as a Mainframe Assembler Engineer, with strong proficiency in Assembler language programming.\n * Hands-on experience with Connex and Switch technologies, including configuration, integration, and troubleshooting.\n * Familiarity with mainframe environments, databases, and tools (e.g., COBOL, JCL, DB2) is a plus.\n * Excellent problem-solving skills and attention to detail.\n * Strong communication and collaboration abilities.\n * Ability to work independently and in a team-oriented environment.\n * Certifications in mainframe technologies or “Connex on IBM MF”/Switch platforms are advantageous.\n * 8+ years of IT experience and minimum 3 plus experience in “Connex on IBM” and payments domain.\n\n\n\n\n\n\nRequired Skills\n\n\n\n\n\n\n\n * Strong proficiency in Assembler language programming.\n * Hands-on experience with Connex and Switch technologies.\n * Excellent problem-solving skills.\n * Strong communication and collaboration abilities.\n\n\n\n\n\n\nPreferred Skills\n\n\n\n\n\n\n\n * Familiarity with mainframe environments, databases, and tools (e.g., COBOL, JCL, DB2).\n * Certifications in mainframe technologies or “Connex on IBM MF”/Switch platforms.\n\n\n\n\n\n\nPay range and compensation package\n\n\n\n\n\n\n\nNot specified in the job description.\n\n\n\n\n\n\n\nEqual Opportunity Statement\n\n\n\n\n\n\n\nWe are committed to diversity and inclusivity in our hiring practices.\n\n\n\n\n```",
   "jobUrl": "https://in.linkedin.com/jobs/view/software-engineer-at-tech-mahindra-4252698145?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Sr. CAD Designer",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Design, Art/Creative, and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nCATIA NC PROGRAMMER Job description Mandatory skills: Minimum 5 yrs. Experience in NC programming, Validation, and proving of 3, 4, and 5 axis Machines using CAD/CAM Software CATIA V5. To have experience in verify and check toolpaths using Vericut 7.4 or later version. To have experience in aerospace material machining like Al Alloy, Stainless steel and Titanium Alloy. To be Familiar with Machine controls Like Fanuc, Heiden Hein and Siemens and capable to read, validate, and analyze NC codes using these controls. Capable to determine cutting tools size and parameters (feed, speed, and depth of cut). To have good shop floor knowledge and having minimum 2 or more years of shop floor working experience. To create operation Machining sequences for part programming. Review customer inputs and plan the machine, material size considering Grain flow, reading blueprints, deciding number of setups. Optimizing existing CNC Programs to reduce cycle time. Responsible to support in maintaining the efficiency and effectiveness of all project related processes. Capable to work individually with less supervision and Good problem solving techniques to assist project team. Develop and implementing smooth execution and validation of the entire NC Programming related issues and effectively communicating with the team for resolution of issues during the execution of project. Root cause analysis for non confirmed part and Implementation of methods to close the non conformance report. Creation of Process flow chart and maintaining quality standards as per Project and familiar with standards like ISO9001, AS9100. Etc for Quality audits. Desired skills Familiar in CATIA V5 work benches like Advanced Machining, part design, surface design and drafting Creation of CATIA part drawings, Drafting, Detailing as per client requirements. Capable to Manufacturing assistance to shop floor for proving parts on machines. Primary CAD/CAM Tools: CATIA V5 and Vericut MS Office\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-cad-designer-at-tech-mahindra-4247464774?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Sr. Engineer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n\"Chassis Systems ¿ Mech Engg Design Engineer 2 10 years exp. in Chassis Suspension/Steering/Brakes/HVAC/Fuel/Frame components. Team member to ensure efficiency in process and meeting project targets ¿ VAVE/Benchmarking projects experience added advantage ¿ Experience in Design & development of Chassis Suspension/Steering/Brakes/HVAC/Fuel/Frame components ¿ Knowledge of Vehicle integration and packaging of Chassis components & articulation ¿ Knowledge and working of EV Vehicles added advantage ¿ Commercial vehicle knowledge and experience is a must. Heavy Commercial vehicles (Truck/Bus) experience will be an added advantage. ¿ Experience on complete vehicle teardown & system level teardown, Understanding manufacturing and product cost accounting. ¿ Work cross functionally with other functions. This requires the incumbent to have ambition, drive, enthusiasm and strong practical engineering experience to compliment his/her technical ability. ¿ Well verse with VA VE work for Design, materials, processes and push design to cost saving proposals. ¿ Generate ideas/alternatives/Brainstorming to current design for cost saving proposals. ¿ Hand¿s on UG NX is must to study CAD data and work on ideas/proposals, Teamcenter. ¿ Support \"\"should cost\"\" analysis based on industry best practices & competitive intelligence. ¿ Better understanding of current product, engineering changes, future product design, material cost increase offset etc. ¿ Utilizing engineering principles to evaluate comparable product designs for cost and process impacts ¿ Gain understanding of the interaction between design and manufacturing in product development and key cost drivers.\"\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-engineer-at-tech-mahindra-4181139609?trk=public_jobs_topcard-title",
   "postedTime": "3 months ago"
 },
 {
   "title": "Sr. Engineer",
   "companyName": "Tech Mahindra",
   "location": "Chennai, Tamil Nadu, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nExpertise in Catia V5 & experience in any plastic part design is must. Job Description: Qualification & Experience BE / B Tech. Mechanical or equivalent Experience in any Plastic part design using Catia V5 & TCUA for 4 6 years. Added advantage: Experience in HVAC system design is an added advantage. Work Location : Chennai Job Responsibilities Design & Modeling of automotive HVAC & plastic components using CATIA V5. Strong usage & flexibility on Catia V5 environment. Good knowledge & Exposure to GD&T, DFA & DFM. Good level of exposure on design of Plastics. Support team of Design / CAD engineers to deliver Quality data as per project requirements. Must have exposure to PLM, preferable TcUA. Job Requirement\n\n\n * Concept design and development for New vehicle HVAC programs.\n * Convert Concept to detailed design.\n * Review Tooling requirements & Manufacturing feasibility.\n * Detailing & creation of manufacturing drawings with GD&T. Tool Skill Set Catia V5 (Part design, Assembly design, Generative shape design & Drafting. Kinematics & Simulation is an added advantage.)\n   \n   ",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-engineer-at-tech-mahindra-4229185270?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Mumbai, Maharashtra, India",
   "experienceLevel": "Associate",
   "contractType": "Full-time",
   "workType": "Other",
   "sector": "IT Services and IT Consulting",
   "description": "The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.\n\n\n\nResponsibilities\n\n1. Complete Understanding of Oracle Apps and E-Business Suite Architecture and underlying table structures and their usage to design efficient program units.\n\n2. Must have strong experience in RICE Components.\n\n3. Develop/maintain oracle custom code and interfaces to oracle forms - based applications in accordance with business requirements.\n\n4. Develop PL/SQL packages, procedures, and functions, and trigger from UI events or database triggers, to implement complex business logic.\n\n5. Proficient in Form Personalization.\n\n6. Work with functional consultants to come out with the appropriate technical design for business requirements.\n\n7. Document all technical designs as well as comment or annotate actual development.\n\n8. Be responsible for complete unit testing and integration testing with other custom components and the larger oracle application.\n\n9. Good knowledge of Shell scripting, Java, SQL tuning, Designing of OAF pages is a plus.\n\n10. Experience in R12 and 11i Series with Modules like AP,AR,GL,FA,INV,OM.\n\n11. Solid Business Process / Requirement Analysis and Re- engineering Required.\n\n12. Proficient in Oracle Forms, Oracle Reports (BI / XML / RDF), Oracle Workflow and Oracle RDBMS.\n\n13. Good Understanding of Performance Tuning.\n\n14. Must be Familiar with APPS Data Model and Oracle Coding Standard.\n\n15. Should have a good communication skill.\n\n\n\n\nQualifications\n\n\n\n\n * Bachelor's degree or equivalent experience in Computer Science or related field\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/software-engineer-at-tech-mahindra-4241875595?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Sap Customer Relationship Management Consultant",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Associate",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Looking for Below positions and Immediate joiner - 15-20 days\n\n\n\n\nSAP CRM-Case\n\nSAP CRM-Contracts\n\n\n\n\nLocation: Hyderabad/Bangalore/Pune etc\n\nHybrid Model\n\n\n\n\nInterested candidates can reach me to RM00691717@TechMahindra.com",
   "jobUrl": "https://in.linkedin.com/jobs/view/sap-customer-relationship-management-consultant-at-tech-mahindra-4255487511?trk=public_jobs_topcard-title",
   "postedTime": "4 days ago"
 },
 {
   "title": "Sr. Business Analyst",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Research, Analyst, and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nThe Ambulatory Team Team work on delivery and support of a variety of solutions that help our clients meet business objectives. These solutions range from large scale ground up custom developed applications, to cloud based development and integration services as well as customizing industry sector focused packages. CONSULTANT As a Consultant at Tech Mahindra, you will be responsible for providing support to Hospitals on Athena and eCW. You will be responsible for mentor junior team members, collaborating team across locations to understand the functional application support to be provided and handling real time issues occurred during delivering service through the application. You will be involved in providing analytical solutions to the client proactively. You would also be responsible for tracking status and collecting metrics for analysis. QUALIFICATIONS: Education: ¿ Bachelor¿s degree from accredited university with strong academic record. ¿ MHA/B.E./B.Tech./MCA/MSc/M.Tech/MBA or any medical background Prior Experience: 3 6 years of work experience in EMRs (like Athena and eCW) or good understanding of healthcare workflows. Skills / Project Experience required: ¿ Demonstrate good understanding of US Healthcare domain knowledge and client workflows ¿ Ability to perform system builds, configuration and testing in Athena and eCW EMR ¿ Ability to understand Service Level Agreement (SLA) methodology and follow the same as per engagement requirements ¿ Perform problem management activities such as Root cause analysis of incidents ¿ Excellent documentation skills such as application understanding, change management etc ¿ Ability to follow engagement specific project delivery processes ¿ Ability to perform estimation of work products ¿ Proactive drive on improvement and innovation ideas ¿ Good interpersonal and communication skills ¿ Knowledge and experience working with Microsoft Office tools / ticketing tools. Work you¿ll do ¿ Manage application enhancements, break fixes, standard applications changes and maintenance activities ¿ Establish guidelines for complex to critical issue handling, templates for optimization requests and ensure that the team follows them. ¿ Develop solutions following established timelines, application development standards and quality processes in projects. ¿ Providing information about any regulatory or privacy related changes which will be impacting the day to day activities of the team and related changes accordingly. ¿ Run the daily calls / scrum meetings with respect to deliverables and build the weekly status reports to be reviewed with leadership. ¿ Perform detailed reviews on deliverables. ¿ Seek to gain cross module knowledge ¿ Interact with onsite clients, coordinator / scrum master, analyst and offshore development, support team and other cross functional teams. ¿ Work on Referring provider build, Provider notification requests which includes Provider and department builds and Updates ¿ Work on Schedule and Pharmacy builds for eCW and manage the Incidents within the defined SLAs\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-business-analyst-at-tech-mahindra-4230121063?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Senior Functional Analyst",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting and Banking",
   "description": "Experience: 10+ years\n\nPositions: 2 Nos\n\nLocation – Pune\n\nWork Mode: Hybrid, 3 days a week from client place\n\nBanking/Wealth domain Exp is must\n\nClient: Deutsche Bank\n\nNotice Period: Immediate upto 45 Days\n\n\n\nJob Description –\n\n\n\n * Overall 10+ years of Experience\n * Exposure to working with Data Warehouses, Regulatory Reporting framework. Data Warehouse and analysis experience in wealth management domain is Mandatory.\n * Experience in Anti Financial Crime (AFC) and Transaction Monitoring is desired --- this is Optional.\n * Bachelor's Degree and/or any finance-related courses with a proven record of accomplishment in banking, shared service, or in finance industry. ACAMS or similar industrial accreditation would be a plus.\n * Possessing work exposure in Transaction Monitoring on different products, regions and being well versed in AML regulations will be required. While having exposure in platforms like ACTIMIZE, FIRCOSOFT, MANTAS, etc. would be highly preferred.\n * Experience in a Banking /Wealth management domain and/or related support functions including understanding of products, business and operational processes, with exposure to business analysis will be required. The candidate should be able to understand business requirements, translate them into requirement documents and explain to development teams. The candidate should be also able to analyze data (very heavy data volumes) and prepare reports according to what is required by business.\n * Experience of working in Agile Environment.\n * Clear ability to provide concise, precise and managerial answers to a wide array of business related topics\n * Relevant and demonstrable experience in designing and documenting requirements in agile teams\n * An organized self-starter able to manage in a complex environment\n * A team player who continually collaborates and shares information\n * Continually looks to simplify and standardize solutions\n * Actively seeks to reduce complexity and do the \"right thing\"\n * Persistent in your drive for quality and excellence\n * Architecturally minded with an ability to simplify complex activities\n * Influencer and problem solving person\n * Fluent in English (written/verbal) additional language(s) are an advantage\n * Familiar with Excel, PowerPoint, Visio etc.\n * Ability to work in a Matrix organization with stakeholders spread across geographies.\n * Understanding of executing projects in agile (scrum) methodology\n * Ability to identify and interpret stakeholders needs and requirements\n * Self-motivated and flexibility to work autonomously coupled with ability to work in virtual teams and matrix/global organizations including appreciation of different cultures during collaborating and sharing.\n * Ability to influence and motivate other team members and stakeholders through strong dialogue, facilitation and persuasiveness.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/senior-functional-analyst-at-tech-mahindra-4252678411?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Test Automation Specialist",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "About the Company:\n\n\n\n\nLooking for Test Automation Engineers with overall 8 -12 years of experience in testing and at least 6 years of experience in test Automation.\n\n\n\n\nJob Location:\n\n\n\n\nOpen for PAN India\n\n\n\n\nAbout the Role:\n\n\n\n\nThis position is in a test automation COE, that would focus on improving existing automation practices and process.\n\n\n\n\nResponsibilities:\n\n\n\n\n * Exposure in ADO as a test management tool\n * Involve a significant amount of audit of existing automation code and infra.\n\n\n\n\nQualifications\n\n\n\n\n * Overall 8 -12 years of experience in testing\n * At least 6 years of experience in test Automation\n\n\n\n\nRequired Skills:\n\n\n\n\n * Exposure in ADO as a test management tool\n\n\n\n\nPreferred Skills:\n\n\n\n\n * Nice to have: Python / Java\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/test-automation-specialist-at-tech-mahindra-4244673260?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Sr. Engineer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n\n * Frames and mounting aggregates knowledge, 2. Sheet metal manufacturing processes knowledge, DMEA, DFA, DFS, DFM. 3. Good Knowledge in joinery design, Bolted, rivetted, 4. Knowledge of DVP, 5. Hands on experience in CATIA. 6. Ability to resolve the problems, 7. Basic knowledge of CAE\n   \n   ",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-engineer-at-tech-mahindra-4260047735?trk=public_jobs_topcard-title",
   "postedTime": "6 hours ago"
 },
 {
   "title": "Prompt Engineering",
   "companyName": "Tech Mahindra",
   "location": "Mumbai Metropolitan Region",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nGenAI Prompt Engineering Mandate SKill- GenAI, Azure/AWS Exp-3-6 Yrs Location- Mumbai/Pune Development & Tech Support Working with cross functional teams, including data scientists, developers, and UX/UI designers, to integrate AI components seamlessly into automation workflows. Analysing tool Performance: Monitoring and evaluating the performance of tool rate limits, throughput etc. Collaborating with Business Teams: Provide assistance and training to business teams in crafting effective prompts to guide the tool in generating accurate and relevant responses. Assisting users in understanding and utilizing the tool effectively. Addressing user queries and troubleshooting issues related to AI prompts. Continuously refining prompts based on performance and feedback.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/prompt-engineering-at-tech-mahindra-4243840567?trk=public_jobs_topcard-title",
   "postedTime": "4 weeks ago"
 },
 {
   "title": "Cloud Consultant",
   "companyName": "Tech Mahindra",
   "location": "Bangalore Urban, Karnataka, India",
   "experienceLevel": "Executive",
   "contractType": "Full-time",
   "workType": "Administrative",
   "sector": "IT Services and IT Consulting",
   "description": "Cloud Engineering\n\n\n\n\nExp:8-15yrs\n\nLocation: Bangalore\n\nNP:30days\n\n\n\n\nJob Profile: Cloud Engineer - Clustering & Pacemaker Expertise\n\n\n\n\nPosition Overview: We are seeking a highly skilled Cloud Engineer with specialized expertise in clustering technologies, particularly Pacemaker, along with strong knowledge of hyperscaler platforms (Azure, AWS, GCP, IBM Cloud). The ideal candidate will have deep experience working with Red Hat Enterprise Linux (RHEL) and SUSE Linux Enterprise Server (SLES) and the ability to design and implement high-availability solutions using Pacemaker clustering across multiple OS environments. This role is integral to ensuring the stability and availability of cloud-hosted applications, particularly for SAP workloads, and includes leading proof of concept (PoC) projects, as well as collaborating closely with development teams to prepare requirements and documentation.\n\n\n\n\n· Technical Skills:\n\no In-depth knowledge and hands-on experience with Pacemaker clustering, including resource agents, fencing, and quorum management.\n\no Strong understanding of cloud platforms (AWS, Azure, GCP, IBM Cloud) with experience in implementing HA solutions.\n\no Experience in deploying and managing SAP systems (S/4 HANA, Netweaver, HANA) in a high-availability clustered environment.\n\no Familiarity databases like HANA and DB2 (optional) in a clustered and HA setup.\n\no A plus (optional): experience with automation tools (e.g., Ansible)\n\n· Soft Skills:\n\no Excellent problem-solving and troubleshooting skills with a focus on complex high-availability configurations.\n\no Strong ability to collaborate with cross-functional teams, providing technical leadership in clustered and high-availability solution design.\n\no Fluent communication skills (verbal and written) in business English, with experience in preparing and presenting technical documentation and reports.\n\nPreferred Skills:\n\n· Advanced certifications in Pacemaker, Red Hat, SLES and SAP systems.\n\n· Experience in designing and implementing multi-cloud high availability architectures.\n\n·\n\nExperience:\n\no Ideally multiple years of experience in clustering and high availability solutions, with a deep focus on Pacemaker and associated technologies.\n\no Hands-on experience in cloud environments (AWS, Azure, GCP, IBM Cloud) with a focus on HA architecture and cloud-native services.\n\no Extensive experience with Linux-based operating systems (RHEL, SLES), including basic knowledge of system administration and OS tuning in clustered environments.\n\n\n\n\n\n\n\nKey Responsibilities:\n\n1. Clustering & High Availability Expertise:\n\no Design and implement Pacemaker clustering solutions across multiple operating systems (RHEL, SLES) and platforms to ensure high availability and fault tolerance of critical applications databases and services.\n\no Contribute to clustering architecture decisions, ensuring optimal scalability, and reliability of business-critical workloads.\n\no Troubleshoot and resolve complex issues related to Pacemaker clusters, providing expert guidance on configuration, failover testing and cluster architecture.\n\n2. Hyperscaler Experties:\n\no Utilize extensive knowledge of hyperscaler platforms (Azure, AWS, GCP, IBM Cloud) to design, deploy, and maintain cloud high availability solutions\n\no Implement and manage cloud-based high availability (HA) solutions in multi-cloud environments, leveraging cloud-native services alongside Pacemaker clustering for mission-critical applications.\n\n3. Proof of Concepts & Architecture Documentation:\n\no Lead and support for proof of concept (PoC) exercises to evaluate new clustering architectures and solutions, documenting the setup, configurations, and lessons learned.\n\no Produce detailed technical documentation covering clustering configurations, architecture diagrams, and deployment processes, ensuring knowledge transfer, reproducibility and further automation.\n\n4. SAP Solution Basis & Integration:\n\no Leverage expertise in SAP Solution Basis, specifically SAP S/4 HANA, Netweaver, and HANA databases, to implement and optimize clustering solutions for SAP workloads in the cloud.\n\no Ensure that SAP systems are properly integrated with Pacemaker clustering to meet high availability requirements.\n\n5. Additional Database Knowledge (Optional):\n\no Support DB2 and other database solutions in the context of clustering and high availability to ensure optimal database performance and uptime.\n\no Collaborate with database teams to implement clustered databases that are tightly integrated with the cloud infrastructure and clustering technologies.\n\n6. Collaboration & Requirement Preparation:\n\no Work closely with development and business teams to define infrastructure requirements for clustered solutions.\n\no Participate in detailed requirement analysis sessions with internal and external stakeholders to ensure clustering and HA solutions meet SAP ECS needs and requirements.\n\n7. Communication & Reporting:\n\no Fluent in business English, with the ability to communicate technical concepts clearly to both technical and non-technical stakeholders.\n\no Prepare and deliver technical presentations, status reports, and documentation related to clustering solutions and cloud architectures.\n\n\n\n\nQualifications:\n\n· Education: Bachelor’s degree in Computer Science, Information Technology, or a related field. Advanced certifications in cloud platforms (Azure, AWS, GCP) and clustering technologies (Pacemaker) are a plus.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/cloud-consultant-at-tech-mahindra-4252664739?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Sr. Engineer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nJob Title: Core Engineering Specialist Location: TechM Pune Hinjewadi Years of Experience: 5 7 Years Job Summary: We are seeking a highly skilled Core Engineering Specialist with a strong background in Body in White (BIW) processes. The ideal candidate will have 5 7 years of experience in the automotive or manufacturing industry, demonstrating expertise in BIW design, development, and optimization. This role requires a proactive individual who can collaborate effectively with cross functional teams to deliver high quality engineering solutions. Responsibilities: Lead the design and development of BIW components, ensuring adherence to industry standards and best practices. Collaborate with design, manufacturing, and quality teams to optimize BIW processes and improve overall product performance. Conduct feasibility studies and risk assessments for new BIW projects, providing technical guidance and support. Utilize advanced engineering tools and software to create and analyze BIW designs. Participate in design reviews and provide constructive feedback to enhance product quality and manufacturability. Stay updated with the latest industry trends and technologies related to BIW and implement innovative solutions. Mentor junior engineers and provide training on BIW best practices and methodologies. Mandatory Skills: Strong knowledge and experience in Body in White (BIW) processes and technologies. Proficiency in CAD software (e.g., CATIA, SolidWorks) for BIW design. Experience with manufacturing processes related to BIW, including welding, stamping, and assembly. Ability to perform structural analysis and simulations related to BIW components. Excellent problem solving skills and attention to detail. Preferred Skills: Familiarity with automotive industry standards and regulations. Experience with project management tools and methodologies. Knowledge of lightweight materials and their application in BIW design. Strong communication and interpersonal skills to work effectively in a team environment. Qualifications: Bachelor's degree in Mechanical Engineering, Automotive Engineering, or a related field. 5 7 years of relevant experience in Core Engineering with a focus on BIW. Professional certifications in engineering or project management are a plus. If you are a motivated engineering professional with a passion for BIW and a desire to contribute to innovative projects, we encourage you to apply for this exciting opportunity.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-engineer-at-tech-mahindra-4247462838?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Design",
   "sector": "IT Services and IT Consulting",
   "description": "Dear Candidate,\n\n\n\n\ncurrently we have wonderful opportunity for Bangalore location for full time with Tech Mahindra. Interested candidates are request to hare the updated resume along with below detail to my email id:\n\nNN00848658@techmahindra.com\n\n\n\n\nJD C Embedded with Audio Subsystems\n\nFull time with: Tech Mahindra\n\nWork Location: Bangalore\n\nExperience: 5-10 years\n\n\n\n\nJD:\n\nDevelop and integrate digital audio subsystems including CODECs, filters, and mixers.\n\nStrong background in digital signal processing (DSP) and audio systems.\n\nProficiency in C/C++, System C, and Matlab.\n\nExperience in audio DSP or embedded audio systems development.\n\nExperience with audio filter design (PCM, PDM), CODEC integration, and low-power design.\n\nUse of audio analysis tools (e.g., Adobe Audition, Audio Precision).\n\nFamiliarity with audio standards (e.g., A2DP, aptX, LE Audio).\n\nKnowledge of hardware/software co-design and embedded system constraints.\n\nFamiliarity with Bluetooth audio stack, ANC, and voice enhancement technologies.\n\n\n\n\nshare the below detail along wiht your updated resume:\n\nTotal Exp:\n\nRel exp in C OR C++:\n\nCurrent Location:\n\nCurrent Salary\n\nExpected Salary:\n\nNotice Period:\n\nAre you available for virtual discussion on Saturday:\n\n\n\n\nsincerely\n\nnaveen\n\nNN00848658@techmahindra.com\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/software-engineer-at-tech-mahindra-4245674929?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Network Manager",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nNetwork Design ¿ Architecture & design discussion with Customer together with Nokia team. ¿ Document and identify and perform analysis of all networking technologies. ¿ Prepare research plans and documented projects for all LAN and WAN based methods. ¿ Identify and resolve all technical issues in matter of formulation and creation of strategies. ¿ Develop multi functional technology and multi vendor network based action plans. ¿ Prepare and implement three tier upgrade program and resolve all network issues. ¿ Coordinate Dedicated design document delivery (HLD/LLD/Migration Strategy) to project (internal repository) ¿ Handover Customer approved HLD/LLD and golden configs to Integration Engineer(s)/MoP Creators. ¿ Support any design issues during deployment ¿ Work with Support teams (TAC/TEC) for any post deployment issues in identifying Design vs product issues ¿ SA will be available on call for any integration/migration window as the second point of technical escalation and to help debug an issue before escalating to TAC/TEC. Network Integration ¿ Customer Network plan, technical inputs & activities schedule to be required prior to MOP preparation ¿ Responsible for technical delivery of node integration in network ¿ Prepare MOP to be executed during activity. ¿ Validate MOP generated from tools. ¿ Share MOP with Field team for upload during power on ¿ Engage in troubleshooting during node integration ¿ Coordinate with all stakeholders to make link/services up. ¿ Perform pre AT of node and ensure all configuration and health status is as per requirement. Coordinate with stakeholder to make the node visible in NMS/OSS/Servers. ¿ Participate in AT and handover of node. ¿ Collect logs and upload in folder/mail. ¿ Troubleshoot with TAC team in case of any product issue. Migration MOP preparation ¿ Customer network plan, technical inputs & activities schedule to be required prior the MOP preparation. ¿ Responsible for technical delivery of each Migration ¿ Ensures Process and Procedures are correctly carried out during MOP preparation ¿ Network assessment ¿ Prepare MOP based on network topology and network services as per HLD/LLD. ¿ Validate manual or tool (if available) generated MOP in LAB/Virtual router. Pre post checks needs to be done in LabAvailable for on call support pre/during execution for MOP clarification. ¿ Support execution team in case of any issue in MOP and correction on immediate basis. ¿ Before onboarding resources, Nokia will engage SME for knowledge transfer to Supplier. Migration execution ¿ Responsible for technical delivery of each Migration ¿ Makes Decisions during Migration Window ¿ Ensures Process and Procedures are correctly carried out during execution ¿ Defines migration strategy with procedural steps, priorities, E2E network impact and methodology. ¿ Go through the MOP before execution and seek for MOP clarification (if any). ¿ Executes configuration changes based on approved MoP ¿ Report activity Status in specified format to Nokia team and customer. ¿ Ensure post migration stability by proactively checking traffic trend, system logs, port statistics and sending hourly report to concern stack holders. ¿ Performs troubleshooting as required. ¿ Initiate HO for host swap node migration and assure to get HO declared within define time period. ¿ Collect pre check, during activity and post check log ¿ Troubleshoot with TAC team in case of any product/configuration issue. ¿ Follow protocol in case of any network outage caused due to changes performed. Network Upgra\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/network-manager-at-tech-mahindra-4247303400?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Business Development",
   "sector": "IT Services and IT Consulting and Banking",
   "description": "Job Title: ACI Engineer (Base24 UPF, Java, Groovy, Microservices)\n\nLocation: Bangalore\n\nNotice: 0-30 Days\n\nExperience: 5+ years\n\n\n\n\nRole Overview:\n\nWe are seeking an experienced ACI Engineer with expertise in Base24 UPF, Java, Groovy scripting, and Microservices. This role focuses on developing, maintaining, and optimizing payment processing solutions for high performance and security.\n\n\n\n\nKey Responsibilities:\n\n * Configure and support Base24 UPF for real-time payment processing.\n * Develop Java-based microservices and enhance automation using Groovy scripting.\n * Implement REST APIs and work with ISO 8583/ISO 20022 messaging formats.\n * Deploy applications on cloud platforms (AWS, Azure, GCP) using Docker & Kubernetes.\n * Automate deployments and processes with CI/CD tools (GitHub Actions, Jenkins, UDeploy).\n * Ensure security & compliance (PCI DSS, ISO standards).\n\n\n\n\nRequired Skills:\n\n✅ 5+ year's experience in Base24 UPF & ACI solutions.\n\n✅ Proficiency in Java, Spring Boot, Microservices, Groovy scripting.\n\n✅ Knowledge of ISO 8583, Kafka, SQL/NoSQL databases.\n\n✅ Experience with Cloud, Docker, Kubernetes, CI/CD pipelines.\n\nPreferred:\n\n * Experience with ACI Postilion, Connex.\n * Familiarity with fraud detection & AI-driven analytics.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/software-engineer-at-tech-mahindra-4256647669?trk=public_jobs_topcard-title",
   "postedTime": "8 hours ago"
 },
 {
   "title": "Sr. Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Chennai, Tamil Nadu, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n¿ Design, develop, and maintain both front end and back end components of web applications. ¿ Develop new features and infrastructure to support rapidly evolving business and project requirements. ¿ Build and maintain RESTful , GraphQL APIs for seamless data exchange. ¿ Work with databases, particularly Google BigQuery, to efficiently store, manage, and retrieve data. ¿ Develop interactive dashboards and reports using Grafana to visualize key performance indicators (KPIs) and business trends, providing actionable insights. ¿ Ensure application performance, uptime, and scalability, adhering to high standards for code quality and application design. ¿ Develop and maintain server side applications and APIs to support front end functionality. ¿ Configure and manage cloud services (e.g., virtual machines, storage, network resources) to optimize performance and cost. ¿ Debug and troubleshoot software issues, ensuring quick resolution and minimal disruption. ¿ Implement security and data protection measures to safeguard sensitive information.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-software-engineer-at-tech-mahindra-4244057526?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Sr. Engineer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n\"Product Design & Development Skills 1. Should be excellent in Design & Development BIW SYSTEMS Body Side Panels, A,B,C Pillars, 2. Experience in Style Surface Feasibility & Analysis i.e. checking Draft, Tooling Feasibility, ECE R26 Regulation Evaluation, creating concept proposals Packaging Study with surrounding parts, Benchmarking Study and Analysis, Joining Processes for Sheet metal parts. 3.Knowledge of Sheet Part Operations Piercing, Blanking, Forming, Drawing, Trimming etc. for tooling feasibility. 4. Should have experience in DFx ( Design for Mfg., assembly & Serviceability) 5. Knowledge in tooling, fixings, Materials, GD & T, Stack up DFMEA, DVP etc. will be preferable 6. Understand CAE, Sheet metal Simulation requirements, Targets and results for project requirements & implementation Project Co ordination & Communication Skills 1. Should be responsible for Quality, Delivery Time lines for responsible system. 2. Maintain project status & documentation to present in Customer Meetings. 3. Should be able to give advance inputs to Internal teams & Customer to resolve the issues. 4. Resolve ambiguity through Technical and Strong communication skills with customer. 5. Strong communication , Presentation & Documentation skills\"\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-engineer-at-tech-mahindra-4260052328?trk=public_jobs_topcard-title",
   "postedTime": "6 hours ago"
 },
 {
   "title": "Business Consultant",
   "companyName": "Tech Mahindra",
   "location": "Chennai, Tamil Nadu, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Consulting, Information Technology, and Sales",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nPosition Title: Analyst, ServiceNow HRSD Junior Developer/Business Analyst POSITION SCOPE: This position supports GPI's strategic and operational HR objectives by contributing to the implementation and optimization of the ServiceNow Human Resources Service Delivery (HRSD) platform. The role is instrumental in enhancing employee experience and HR service efficiency by identifying process gaps and streamlining workflows Our HR and IT organizations are transforming how we deliver services at GPI. We collaborate across departments to provide a modern, digital-first experience for employees, with a focus on automation, accessibility, and continuous improvement. POSITION RESPONSIBILITIES: Principal Duties and Responsibilities: Promote ServiceNow HRSD best practices and recommend out-of-the-box solutions where appropriate. Collaborate with Senior ServiceGPI Developers, HR, IT, and plant operations to document business requirements and translate them into technical solutions for the HRSD modules. Analyze and optimize HR processes such as onboarding, offboarding, case management, and lifecycle events. Assist in the development and configuration of ServiceNow HRSD modules such as: Case and Knowledge Management Employee Service Center Lifecycle Events Document Management Support the creation and maintenance of HR workflows, forms, and user interfaces. Participate in testing, debugging, and deployment of HRSD features. Help maintain system documentation, including technical specifications and user guides. Monitor system performance and assist in troubleshooting issues. Stay current with ServiceNow platform updates and HRSD best practices. Coordinate with HR process owners to assess current workflows and identify improvement opportunities. Design and implement strategies to enhance HR service delivery across corporate and manufacturing sites. Communicate and train HR users and plant managers on new processes and tools. Oversee implementation of updated HRSD processes and adjust as needed. Manage HRSD enhancement requests, building requirements and user stories. Facilitate weekly HRSD platform calls and coordinate with developers and ServiceNow representatives. Ensure alignment across HRSD workstreams and prevent overlap or conflicts. Required Qualifications: Bachelor’s degree in Computer Science, Information Systems, Human Resources, or a related field (or equivalent experience). Basic understanding of ServiceNow platform and its architecture. Familiarity with JavaScript, HTML, and web technologies. Strong problem-solving and analytical skills. Excellent communication and teamwork abilities. Eagerness to learn and grow in a fast-paced environment. Preferred Qualifications: Internship or academic project experience with ServiceNow or HR systems. Exposure to Agile/Scrum development methodologies. ServiceNow Certified System Administrator (or willingness to obtain within 6 months). Understanding of HR processes and employee lifecycle.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/business-consultant-at-tech-mahindra-4230761770?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Data Modeler",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Hi,\n\n\n\n\nDescription:\n\n * Have worked on data modelling and data concept design (conceptual and logical data model ) of wealth domain platforms\n * Deep understanding on Wealth and Private banking domain specially with different banking products like Equities, FI, Bonds, UT etc and its life cycle management.\n * Understand SQL to analyze the data from different DBs\n * Someone with 7+ years of experience in wealth domain along with Data platform understanding.\n * Can work closely with business to define the data concept of domain requirement and can articulate the same to tech team.",
   "jobUrl": "https://in.linkedin.com/jobs/view/data-modeler-at-tech-mahindra-4250328890?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Functional Consultant",
   "companyName": "Tech Mahindra",
   "location": "Noida, Uttar Pradesh, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nResponsible for collecting and documenting business requirements, interfacing with project delivery team, testing and delivering application documentation, and recommending effective solutions. Verify business requirements and functional specifications. Ensure that high level business requirements have been decomposed properly into useable functional requirements. Create/ review test scenarios, scripts, test plans and execute them. Interface between technical teams and customer. Design solutions in conjunction with technical teams. Ensure deliverables are being met on a timely basis. Create value proposition and perform a cost benefit analysis. Conduct market research, end user training. Participate in competency building activities and internal trainings.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/functional-consultant-at-tech-mahindra-4240922004?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nShould have 4 to 5 years of experience preferably in Finance Applications 1. Good hands on Exp. in Archer 2.Proficient in analyzing Architecture, Design & Implementation for on demand application development. Expertise in configuring RSA Archer appearance, managing themes, and deploying across environments. 3.Skilled in packaging and deploying from one environment to another, and configuring Dashboards, Workspaces & iViews. 4.Experienced in Data Integration features, including Archer to Archer Data feed and file transporter. 5.Proficient in configuring data driven events, calculated fields, record permissions, and cross references. 6.Expertise in configuring various types of notifications as per client needs and troubleshooting notification issues. Well versed in report configuration to meet specific business needsDeveloped on demand modules like Third Party Risk Management and 7. Good understanding of Functional part of GRC 8. Reliable cross team collaboration (CyberArk, Sailpoint and UAM Tool ) 9. API Integration knowledge in Archer\n\n\n * Archer, UAM Tool\n * Experience with ServiceNow\n * Experience with CyberArk\n * Experience with Sailpoint\n * Strong stakeholder communication skills\n * Preferred to have JIRA Experience\n * Ability to work in multifunctional and multicultural environment\n * Positive attitude and strong work ethics\n   \n   ",
   "jobUrl": "https://in.linkedin.com/jobs/view/software-engineer-at-tech-mahindra-4258037725?trk=public_jobs_topcard-title",
   "postedTime": "5 days ago"
 },
 {
   "title": "Sr. Network Engineer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nJob Description: NOC Engineer L2 (Tier 2 Resolver) Duties and Responsibilities ¿ Providing L2 level of Network and Service Assurance support for enterprise network on routing and switching and is comprised of Cisco based WAN/ LAN / WLAN and SDWAN technologies ¿ Troubleshooting the complex/multi domain/high impact incidents on the network and services that are escalated by Tier 1.5 Service Desk while adhering to SLA/KPIs ¿ Designing and implementing quick fix solutions and work around to ensure that the services are restored till the time the final fix is implemented ¿ Coordinating with the Field Technician for incident resolution to perform the correct actions to resolve the incident ¿ Carrying out the necessary tests to ensure that the solution has been implemented correctly and the incident has been resolved ¿ Escalating the incidents to L 3 Resolver group if the solution needs design change or involvement of OEMs ¿ Carrying out Root Cause Analysis post the incident resolution and publishing the report including recommendations for improvements. ¿ Ability to carry out the change management activities for enterprise sites (Creating and executing the changes), in the provided change window ¿ Guiding the Field Technician for the change implementation, which includes verification of the spares/devices to be deployed and the steps to be performed for the deployment ¿ Carrying out post deployment testing and verification of the changes and providing clearance to the Field Technician to leave the site ¿ Acting as the Technical Point of Contact for the customer Minimum Job Entry Requirements ¿ Bachelor of engineering degree and 5 8 years of experience. ¿ Experience on Large Enterprise Networks in Service assurance area preferably at L2 ¿ Good hands on experience on EIGRP, OSPF, BGP, MPLS, CoS, QoS, VRF, VLANS, and VPNs ¿ Good hands on experience on LAN/WAN/SD WAN technology. ¿ Knowledge and experience on Infoblox DDI (DNS, DHCP & IPAM) and Cisco ISE will be a plus ¿ Must have CCNA R&S or CCNP R&S ¿ Strong skills on MS Office for reports and RCA making. ¿ Strong analytical skills to resolve problems. ¿ Strong oral and written communication skills to coordinate repair efforts and prepare reports. ¿ Strong interpersonal skills to coordinate efforts effectively between multiple groups. ¿ Ability to manage multiple tasks in a fast paced environment. ¿ Self starter with attention to detail and ability to maintain focus over long periods of time. ¿ Willing to work in a rotational shift 24x7 operation Strong hands on experience on the following (Mandatory) ¿ Routers ¿ Cisco ASR 1001 X, Cisco ASR 1001 HX, Cisco ASR 1002 HX ¿ LAN Switches ¿ 9500/9300/9200/6800/4500/3850/3750/3730/3650/83560/3550/2960 ¿ SDWAN ¿ C8500/C8300/C8200/8500L ¿ WAP ¿ 9115/6300/3702/3502/2802/2702/2602/1852/1832/1702/1602/1562 ¿ WLAN Controller ¿ CT3504/5520/9800LC ¿ Radius Server ¿ Cisco ISE/Appliance Server (SDDC)/Halt3 cage SG4 Tools Hands on experience on the following (Mandatory) ¿ Cisco Catalyst Center, IR Prognosis, Nexus Dashboards, Thousand Eyes, Cisco DNA center, Cisco ISE ¿ ITSM/Service Now Grade: U2/U3; Location: Pune/Noida\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-network-engineer-at-tech-mahindra-4219021604?trk=public_jobs_topcard-title",
   "postedTime": "2 months ago"
 },
 {
   "title": "Cerner Application Analyst",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Associate",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Urgent Requirement .... Tech Mahindra Hiring\n\n\n\n\nEXP: 4 to 12yrs\n\nShift: 3:30pm to 12:30am / 5.30pm to 2.30am / 6.30pm to 3.30am\n\nWork Location : Bangalore / Hyderabad / Pune\n\nWork Model : Hybrid (12 days in a month)\n\n\n\nPlease find below JD details.\n\n\n\n· Cerner Application support, Incident resolution, Implementation of Cerner Millennium Projects.\n\n· Experience in configuring and troubleshooting CERNER solution functionalities/Components.\n\n· Perform complex troubleshooting investigations and documenting notes and knowledge articles.\n\n· Gather requirements and determine scope of work and plan for on time delivery.\n\n· Ability to work self-sufficiently on assigned time sensitive tasks.\n\n· Develop and maintain good relationship with peers and client, provide timely feedback to encourage success.\n\n· Strong communication skills with excellent interpersonal skills both in written and verbal correspondence.\n\n· Ability to learn and adapt to changing landscape and acquire new skills with technology advancement and to work, coordinate with global teams.\n\n· Readiness towards work at odd hours/on-call and weekends as and when needed.\n\n\n\n\n\n\n\n\n\n\nBuild & Configuration Experience required in following Cerner Applications :\n\n\n\nCCL reporting\n\nMS4\n\nFSI\n\nCharges\n\nPatient accounting\n\nSecurity\n\nProvider, Ambulatory\n\nRegistration\n\nCerner Rules (Custom Solution Development)\n\nScheduling\n\nSoarian Financials\n\nInvision\n\nHIM\n\n\n\n\n\n\n\nShare profiles to mm00828174@techmahindra.com",
   "jobUrl": "https://in.linkedin.com/jobs/view/cerner-application-analyst-at-tech-mahindra-4246227169?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "AI Engineer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nUpdates head count to 2, as we need 2 AI engineers. Backfill for Gen AI lead Swapnil.Vermani@gds.ey.com, who is going on a long leave Key skillset needed: >5 12 years of experience in delivering DS, ML , AI and Gen AI applications. >Expert knowledge in Python , ML concepts, DS, SQL , Microsoft Azure and Databricks. >Should have understanding of LLMs like OpenAI, BERT transformers. >Familiar with technical agile solution delivery, standard coding practices and deployment guidelines and procedures. >Should have knowledge of Azure devops, Github and should have deployed projects end to end.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/ai-engineer-at-tech-mahindra-4253249529?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Tech Specialist",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nTo contribute to a project as an SME on a given technology or domain and, remain abreast with developments in that technology or domain. Basis the expertise, evaluate the impact of technology on existing technology and systems. To design systems and assess the effectiveness of technology resources already in use or new systems that are being implemented. Determine the practicality of changes and modification of systems. Oversee the optimization, validation, and approval of technology application to customer products. Fully understand all relevant customer technical requirements, processes, procedures, limitations and constraints as well as TechM¿s technology, resources, capabilities, limitations and constraints. Work with the project team to identify and harness technical resources and capabilities required to deliver production and quality metrics as defined by customers Lead technical team through project implementation phase. Articulate and explain designs and constraints to stakeholders after understanding customer perspective. Ensure compliance to internal tools. Sensitize the team to go beyond the immediate deliverables to assess how to provide greater value to the customer on an ongoing basis. Determine methodology and processes for quality planning (in concurrence with project planning), define standards to use, document quality criteria and quality measurement processes, face audits and project process monitoring. Review project profitability and other agreed parameters and provide relevant status reports to the management and customer. Ensure steering committee meetings and other regular meetings with customer. Develop supporting documentation and materials including demonstrations, presentations and other tools to ensure solutions are easy to manage and repeatable. Promote team work, motivate, coach and develop people in the team to build functional skills and desired behaviours to deliver results. Manage complex scenarios effectively like business risks, multiple vendor issues, code red situations etc. and customer expectations without impacting associates adversely. Provide technical and other guidance as required to the team and assess the performance of the associates.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/tech-specialist-at-tech-mahindra-4242539541?trk=public_jobs_topcard-title",
   "postedTime": "4 weeks ago"
 },
 {
   "title": "SAP PP",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Title: SAP PP Consultant\n\nLocation: Bengaluru (Hybrid – 3 Days Work from Office)\n\n\n\n\nJob Description:\n\nWe are looking for an experienced SAP PP (Production Planning) Consultant to join our team in Bengaluru. The ideal candidate should have at least one full-cycle SAP PP implementation experience and a strong understanding of production planning processes.\n\n\n\n\nKey Responsibilities:\n\n * Lead and support SAP PP module implementation and configuration.\n * Collaborate with cross-functional teams to gather business requirements and translate them into SAP solutions.\n * Provide post-implementation support and continuous improvements.\n * Conduct training sessions and create documentation for end-users.\n\n\n\n\nRequirements:\n\n * Minimum 5+ years of experience in SAP PP.\n * At least one end-to-end SAP PP implementation.\n * Strong knowledge of production planning, MRP, BOM, routing, and shop floor control.\n * Excellent communication and problem-solving skills.\n * Willingness to work from the office at least 3 days a week.\n\n\n\n\nPreferred Qualifications:\n\n * Experience with integration to other SAP modules like MM, SD, and QM.\n * SAP certification in PP is a plus.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sap-pp-at-tech-mahindra-4245682487?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Pyspark / Python with Spark -- Chennai/ Bangalore Location",
   "companyName": "Tech Mahindra",
   "location": "Chennai, Tamil Nadu, India",
   "experienceLevel": "Not Applicable",
   "contractType": "Full-time",
   "workType": "Other",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nJob Summary: We are looking for an experienced Senior Software Engineer with deep expertise in Spark SQL / SQL development to lead the design, development, and optimization of complex database systems. As a Senior Spark SQL/SQL Developer, you will play a key role in creating and maintaining high performance, scalable database solutions that meet business requirements and support critical applications. You will collaborate with engineering teams, mentor junior developers, and drive improvements in database architecture and performance. Key Responsibilities: Design, develop, and optimize complex Spark SQL / SQL queries, stored procedures, views, and triggers for high performance systems. Lead the design and implementation of scalable database architectures to meet business needs. Perform advanced query optimization and troubleshooting to ensure database performance, efficiency, and reliability. Mentor junior developers and provide guidance on best practices for SQL development, performance tuning, and database design. Collaborate with cross functional teams, including software engineers, product managers, and system architects, to understand requirements and deliver robust database solutions. Conduct code reviews to ensure code quality, performance standards, and compliance with database design principles. Develop and implement strategies for data security, backup, disaster recovery, and high availability. Monitor and maintain database performance, ensuring minimal downtime and optimal resource utilization. Contribute to long term technical strategies for database management and integration with other systems. Write and maintain comprehensive documentation on database systems, queries, and architecture. Required Skills & Qualifications: Experience: 7+ years of hands on experience in SQL Developer / data engineering or a related field. Expert level proficiency in Spark SQL and extensive experience with Bigdata (Hive), MPP (Teradata), relational databases such as SQL Server, MySQL, or Oracle. ¿ Strong experience in database design, optimization, and troubleshooting. Deep knowledge of query optimization, indexing, and performance tuning techniques. Strong understanding of database architecture, scalability, and high availability strategies. Experience with large scale, high transaction databases and data warehousing. Strong problem solving skills with the ability to analyze complex data issues and provide effective solutions. Data testing and data reconciliation ¿ Ability to mentor and guide junior developers and promote best practices in SQL development. Proficiency in database migration, version control, and integration with applications. Excellent communication and collaboration skills, with the ability to interact with both technical and non technical stakeholders. Preferred Qualifications: ¿ Experience with NoSQL databases (e.g., MongoDB, Cassandra) and cloud based databases (e.g., AWS RDS, Azure SQL Database). Familiarity with data analytics, ETL processes, and data pipelines. Experience in automation tools, CI/CD pipelines, and agile methodologies. Familiarity with programming languages such as Python, Java, or C#. Education: \\Bachelor's or Master's degree in Computer Science, Information Technology, or a related field (or equivalent experience).\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/pyspark-python-with-spark-chennai-bangalore-location-at-tech-mahindra-4228422088?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Sr. Engineer",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n\n * Must be having 6 to 8 years of hands on experience with designing of Automotive Interior Exteriors / Plastics 2. Should be excellent in Interiors and Exteriors Design (IP, Console, Door Trims, Upper Trims, Bumper systems etc.) 3. Should have experience in DFx ( Design for Mfg, assembly & Serviceability) 4. Knowledge in tooling, fixings, Materials etc will be preferable 5. Knowledge in tooling, Joineries, Materials, GD & T, Stack up DFMEA, DVP etc will be preferable 6. Strong communication skills\n   \n   ",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-engineer-at-tech-mahindra-4240103462?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Support Engineer – Electron JS",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Consulting",
   "sector": "IT Services and IT Consulting and Software Development",
   "description": "Job Summary:\n\nWe are looking for a proactive and detail-oriented Support Engineer with expertise in Electron JS, Angular, and Java to join our technical support team. The ideal candidate will be responsible for diagnosing, resolving, and escalating technical issues for both desktop (Electron) and web-based (Angular/Java) applications. This role requires a mix of development knowledge, troubleshooting skills, and customer service orientation.\n\nKey Responsibilities:\n\n * Provide L2/L2.5 application support for software solutions built using Electron JS, Angular, and Java.\n * Troubleshoot production issues, conduct root cause analysis, and implement short-term and long-term resolutions.\n * Monitor application performance and logs, and respond to incidents within defined SLAs.\n * Collaborate with development, QA, and DevOps teams to resolve complex technical problems.\n * Develop support documentation, FAQs, and knowledge base articles.\n * Interface with clients or internal users to understand and clarify issue reports.\n * Participate in on-call rotation or provide after-hours support as needed.\n\nRequired Skills & Qualifications:\n\n * 5-14 years of experience in a technical support, software engineering, or application maintenance role.\n * Must Hands-on experience supporting or developing applications using:\n * Electron JS (desktop apps)\n * Angular (frontend)\n * Java (backend, Spring Boot preferred)\n * Experience in log analysis, performance tuning, and debugging.\n * Familiarity with REST APIs, JSON, Microservices Architecture and web technologies.\n * Strong problem-solving and analytical skills.\n * Proficient with tools like Postman, Git, Jira, Splunk/ELK, and CI/CD pipelines.\n * Excellent verbal and written communication skills.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/support-engineer-%E2%80%93-electron-js-at-tech-mahindra-4253990111?trk=public_jobs_topcard-title",
   "postedTime": "6 days ago"
 },
 {
   "title": "Project Lead",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Project Management and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nTo ensure successful initiation, planning, execution, control and completion of a small or a less complex project through monitoring, tracking and analyzing project control metrics. Lead project development, production support and maintenance activities. Ensure timesheets and invoicing processes are completed on or before the deadline. Lead the customer interface for the project on an everyday basis, proactively addressing any issues before they are escalated. Create functional and technical specification documents. Track open tickets/ incidents in queue and allocate tickets to resources and ensure that the tickets are closed within the deadlines. Ensure analysts adhere to SLA¿s/KPI¿s/OLA¿s. Ensure that all in the delivery team, including self, are constantly thinking of ways to do things faster, better or in an economic manner. Assist Project Manager in Risk Management and participate in quality reviews and implement quality norms. Lead and ensure project complies with Software Quality Processes and is adhering to the defined timelines. Draft initial charter and project plan, create and review functional and technical specification documents. Monitor, track and analyse project control metrics. Review and consolidate project (over all the modules) status reports and lead and perform all activities related to maintaining successful knowledge management including re-usage, accuracy and efficiency. Serve as the single point of contact for the team to the project stakeholders. Promote team work, motivate, mentor and develop subordinates. Provide application production support as per process/RACI (Responsible, Accountable, Consulted and Informed) Matrix.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/project-lead-at-tech-mahindra-4242834377?trk=public_jobs_topcard-title",
   "postedTime": "4 weeks ago"
 },
 {
   "title": "Sr. Data Analyst",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nJob Summary: 5+ years of experience in Tableau Candidate should be very much proficient on Joins. Candidate should be proficient on SQL Analytical functions, CTEs and Sub Queries and their usages, Candidate should be able to understand and debug complex queries. Candidate should have at least basic knowledge on Stored Procedures and how to debug/enhance them. Performance optimization on SQL. Strong knowledge in Tableau reporting. Real Time Experience on Blending/Relationship and their usages Real Time Experience on all types of Actions. Experience on Complex LODs, Table Calculations, Time Series and Date Functions etc. Proficient on all sort of Charts and ability to create Custom charts and visuals. Good Dashboard building skills.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-data-analyst-at-tech-mahindra-4245221777?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Network Lead",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nJD: BE in computer science, Computer Engineering, or related field\n\n\n * Strong understanding of IVR Application Testing, IVR Performance Testing, Outbound Testing\n * Strong understanding of RESTful and SOAP APIs.\n * Proficiency in Postman, Rest Assured, SoapUI, or similar API testing tools.\n * Experience with API automation using Java.\n * Familiarity with SQL for database validation.\n * Knowledge of API documentation tools like Swagger.\n * Develop, execute, and maintain test cases for RESTful and SOAP APIs.\n * Identify, log, and track defects, collaborating with developers to resolve issues.\n * Create test plans, test cases, test scripts, and test reports.\n * Expert in APIs security standards by testing authentication, authorization, and data protection.\n * Work closely with developers, business analysts, and QA teams to enhance product quality.\n * Hands on experience in UI automation using selenium.\n * Strong understanding of BDD cucumber frameworks\n   \n   ",
   "jobUrl": "https://in.linkedin.com/jobs/view/network-lead-at-tech-mahindra-4253137618?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "DAON Engineer",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Product Management",
   "sector": "IT Services and IT Consulting",
   "description": "We are seeking a highly skilled and self-driven DAON Engineer with hands-on experience in DAON identity platform and TrustX framework. The ideal candidate will be capable of working independently to design, develop, and support secure and scalable biometric authentication solutions. This is a critical role in ensuring seamless integration and management of digital identity services across our platforms.\n\n\n\n\nKey Responsibilities:\n\n * Design, implement, and maintain identity verification and biometric authentication solutions using DAON and TrustX.\n * Integrate DAON services (IdentityX, TrustX) into mobile and web applications.\n * Support end-to-end onboarding and identity lifecycle management for users.\n * Collaborate with cross-functional teams to define and deliver secure and scalable identity solutions.\n * Troubleshoot and resolve issues related to DAON SDKs, APIs, and TrustX configuration.\n * Maintain strong documentation and knowledge-sharing practices for delivered solutions.\n * Ensure compliance with security and privacy standards (e.g., GDPR, ISO 27001).\n * Operate independently, manage time effectively, and take full ownership of deliverables.\n\n\n\n\nRequired Skills and Experience:\n\n * 3+ years of relevant experience with DAON identity solutions (e.g., IdentityX, TrustX).\n * Strong knowledge of biometric technologies (face, voice, fingerprint recognition).\n * Hands-on experience with DAON TrustX configuration and deployment.\n * Solid experience with RESTful APIs, SDK integration (iOS/Android/Web).\n * Familiarity with identity and access management (IAM) protocols (OAuth2, SAML, OpenID Connect).\n * Proven ability to work independently and manage complex projects with minimal supervision.\n * Excellent problem-solving skills and ability to troubleshoot production issues.\n\n\n\n\nPreferred Qualifications:\n\n * Experience in the financial services, healthcare, or regulated industries.\n * Understanding of DevOps tools and CI/CD pipelines.\n * Familiarity with cloud environments (AWS, Azure, or GCP).\n * Strong communication and documentation skills.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/daon-engineer-at-tech-mahindra-4254325573?trk=public_jobs_topcard-title",
   "postedTime": "6 days ago"
 },
 {
   "title": "Project Lead",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Project Management and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n\"1. Should be excellent in Exteriors Product Design & Development (Front & Rear Bumper systems, Grill, Energy Absorber, Claddings etc.) 2. Knowledge & Experience in Benchmarking of exterior systems 3. Experience in Style Surface Feasibility & Analysis i.e. checking Draft, Tooling Feasibility, ECE R26 Regulation Evaluation, creating concept proposals Packaging Study with surrounding parts. 4. Work on concept feasibility and prepare concept proposals. Conduct Packaging Study. 5. Should have experience in DFx ( Design for Mfg, assembly & Serviceability) 6. Knowledge in tooling, fixings, Materials, GD & T, Stack up DFMEA, DVP etc. will be preferable 7. Understand CAE requirements and results for project requirements & implementation 8. Review, Check the project 3D & 2D Data, Give Feedbacks to team members on day today basis. . Project Co ordination & Communication Skills 1. Should be able to handle Team of 3 5 Members. Strong Project Management Skills. 2. Experience as Single Point of Contact for Customer & Internal Teams. 3. Project Plan preparation, Issue Resolution Skills., Maintain project status. 4. Should be responsible for Quality, Delivery Time lines for responsible system. 5. Should be able to give advance inputs to Internal teams & Customer. 6. Resolve ambiguity through Technical and Strong communication skills with customer & Internal teams. 7. Strong communication , Presentation & Documentation skills\"\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/project-lead-at-tech-mahindra-4176561476?trk=public_jobs_topcard-title",
   "postedTime": "3 months ago"
 },
 {
   "title": "WAF Business Analyst",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology, Consulting, and Analyst",
   "sector": "IT Services and IT Consulting, Software Development, and Business Consulting and Services",
   "description": "Role: WAF Senior BA, in this role you will perform:\n\n\n\n\nWe are looking for an experienced Infrastructure analyst with Web Application Firewall knowledge who has expertise in web application security, content distribution and other IT infrastructure services. We expect the candidate to have practical experience in managing and administrating Enterprise/Web applications and CDN.\n\n· Resolve technical issues and put together, maintain Web Application Firewall TOM, Capability model.\n\n· To be the point of contact for Bank’s contracts for WAF implementation and resolve all technical issues individually or in support with CDN/WAF customer care or professional services.\n\n· Direct and ensure the successful outcome of projects – coordinate with vendor technical project team and CDN/WAF solution engineer\n\n· To coordinating various teams in the planning, execution, implementation and their successful conclusion for Web Application Firewall related activities in the project.\n\n· To work closely with stakeholders by setting expectations, managing scope and risk, communicating status to senior management and ensure project meets designed business outcomes and objectives.\n\n· Own the technical components of an integration project including configuration changes, debugging, documentation, testing, and go live support\n\n· Coordinate with Web Application Firewall vendor customer care to resolve issues that arise during integrations, or post implementation support.\n\n· Accurate scope implementation timelines for integrations\n\n· Identify technical risks and provide mitigation strategies\n\n· Review configurations with Web Application Firewall vendor professional services team members to ensure quality and accuracy to requirements\n\n· Ability to work closely with stakeholders and service owners to ensure effective coordination of changes as per the organizations change management principles.\n\n· Collaborate with project and technical teams to ensure changes are implemented in a timely, effective and efficient manner to meet project deadlines\n\n· Coordination of Release management & ITSOs\n\nTool - Akamai(Primary) and F5 (secondary),\n\nBest Practice – WAF Targeting Operating Model and its deep understanding\n\nExperience – Business Analyst (who tracked all bits and pieces and have understanding) (primary) and Deployments technically with documentation skills (technical manager) (secondary)\n\n\n\n\nTo be successful in this role, you should meet the following requirements:\n\n· Exposure to version control systems, build and deployment tools\n\n· Knowledge in AWAF or WAF solutions is beneficial\n\n· Strong understanding of agile methodologies\n\n· Understanding of Software quality management, quality control management and version control management\n\n· Excellent verbal and written communication skills, with proven ability to disseminate information in clear and correct manner to business and technical audiences\n\n· Strong relationship building skills, with the ability positively influence the actions of others, working as a team player\n\n· Ability to manage multiple priorities, commitments and projects.\n\n· Minimum 8+ years of experience (in relevant technical skills mentioned above)\n\n· Candidate will require to work over weekend occasionally.\n\n\n\n\nLocation: Hyderabad/Pune",
   "jobUrl": "https://in.linkedin.com/jobs/view/waf-business-analyst-at-tech-mahindra-4256645977?trk=public_jobs_topcard-title",
   "postedTime": "8 hours ago"
 },
 {
   "title": "Sr. Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nCollaborating with cross functional teams to define software requirements Designing and developing high quality software solutions using Java Debugging and troubleshooting Java applications Enhancing the performance and scalability of existing systems Conducting code reviews, and ensuring coding best practices Implementing security measures to protect applications Keeping up to date with the latest Java trends and technologies Creating technical documentation for reference Participating in software testing and quality assurance processes Assisting in the deployment and maintenance of Java applications Proficiency in Java programming language Experience with Java frameworks and libraries Hands on experience in the design and development of applications using Java EE platforms Knowledge of current frameworks, SDKs, APIs, and libraries. Knowledge of relational databases, SQL and ORM technologies (JPA2, Hibernate, etc.) Knowledge of web technologies (e.g., HTML, CSS, and JavaScript) Familiarity with version control systems (e.g., Git) Understanding of software development lifecycle Strong knowledge of software development methodologies Problem solving and analytical thinking Excellent communication and teamwork skills Ability to adapt to new technologies and tools quickly\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-software-engineer-at-tech-mahindra-4214009170?trk=public_jobs_topcard-title",
   "postedTime": "2 months ago"
 },
 {
   "title": "Project Lead",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Project Management and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nAbility to perform Authoring in S1000D standards based on the input received for all Airbus programs Ability to create illustration mockups Mechanical & Electrical by studying the inputs Ability to understand aircraft manuals like IPC, AMM, AWL ASM and SRM Good Knowledge and interpretation of engineering drawings. Possess good knowledge of Airbus process and standard guides. Must have good oral, written and organizational skills Must have good knowledge on illustration tools like TECH DRAW, Tech Illustrator Must have good knowledge on Arbor text EPIC Editor, SAMM Must have good knowledge Airbus Tools: SAP, GILDA, ZAMIZ, Airn@v, CIRCE C , GILDA ETC., Relevant Experience Preferred\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/project-lead-at-tech-mahindra-4258416380?trk=public_jobs_topcard-title",
   "postedTime": "4 days ago"
 },
 {
   "title": "Network Lead",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nNetwork Engineer ¿ L2/L3 ¿ India (Pune and Hyd) (24x7 support Shift) with Work from office. Primary Skills: Networking concepts with NAC deployment experience, CCNA, CCNP. Experience: 7 to 10 years of total work experience. Required Skills: Strong experience on Routing and Switching, BGP & Cisco ASR, Juniper Routers Strong troubleshooting techniques on Networking technology Managed large enterprise WAN, LAN and WLAN networks. Hands on experience with NAC deployment. Expertise in multi vendor L2/L3 switches. In depth knowledge of LAN/WAN support for data networks at Access, Aggregation, and Core network including redundancy protocols such as HSRP, VRRP etc. In depth knowledge of WLAN technologies ¿ Wireless controller & access points. Thorough understanding of modern service provider TCP/IP data networks including MPLS, OSPF, BGP4, STP, RSTP, VTP, VLAN. Familiarity with MPLS & WAN communication technology like Internet VPN, SSL VPN. Good knowledge and hands on experience with routing\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/network-lead-at-tech-mahindra-4253137619?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Network Architect",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nGeneral Skills GCP level real life experience working with Genesys cloud, Architect flow, WFM, roles and access groups, messaging, reporting. SSO, SCIM and REST based backend integration via data actions. Social Hands on experience with social channel (Facebook, Twitter, Line, WhatsApp) design and integration with Genesys cloud, Architect flow development Voice/Chat Bot Hands on experience with social channel (Facebook, Twitter, Line, WhatsApp) design and integration with Genesys cloud, Architect flow development Advanced IVR/Speech Recognition Hands on experience developing advanced complex IVRs in Architect including TTS, ASR Coding ¿ platform API & SDK Hands on experience developing applications using Genesys cloud APIs with SDK (Java, Javascript, .NET etc.) Workforce Management Hands on experience with Genesys WFM platform, design, implementation, configuration. Transformation, Implementation Experience contact centers + 2 + Genesys cloud experience\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/network-architect-at-tech-mahindra-4257244950?trk=public_jobs_topcard-title",
   "postedTime": "6 days ago"
 },
 {
   "title": "Network Lead",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nGenesys Contact Centre test experience Genesys WFM knowledge Contact Centre Reports testing experience is beneficial. Omni Channel testing experience preferred i.e. Webchat, Email, Social Media Writing test scripts from designs, including call flow test cases from Visio Working knowledge of Jira, Excel, Word Able to work independently and as part of a team. Ability to lead testing projects. Ability to communicate effectively, including on customer facing calls.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/network-lead-at-tech-mahindra-4249899878?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "Tech Lead",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nTo ensure successful initiation, planning, execution, control and completion of the project by guiding team members on technical aspects, conducting reviews of technical documents and artefacts. Lead project development, production support and maintenance activities. Fill and ensure timesheets are completed, as is the invoicing process, on or before the deadline. Lead the customer interface for the project on an everyday basis, proactively addressing any issues before they are escalated. Create functional and technical specification documents. Track open tickets/ incidents in queue and allocate tickets to resources and ensure that the tickets are closed within the deadlines. Ensure analysts adhere to SLA¿s/KPI¿s/OLA¿s. Ensure that all in the delivery team, including self, are constantly thinking of ways to do things faster, better or in a more economic manner. Lead and ensure project is in compliance with Software Quality Processes and within timelines. Review functional and technical specification documents. Serve as the single point of contact for the team to the project stakeholders. Promote team work, motivate, mentor and develop subordinates. Provide application production support as per process/RACI (Responsible, Accountable, Consulted and Informed) Matrix.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/tech-lead-at-tech-mahindra-4253498198?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Tech Lead",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nTo ensure successful initiation, planning, execution, control and completion of the project by guiding team members on technical aspects, conducting reviews of technical documents and artefacts. Lead project development, production support and maintenance activities. Fill and ensure timesheets are completed, as is the invoicing process, on or before the deadline. Lead the customer interface for the project on an everyday basis, proactively addressing any issues before they are escalated. Create functional and technical specification documents. Track open tickets/ incidents in queue and allocate tickets to resources and ensure that the tickets are closed within the deadlines. Ensure analysts adhere to SLA¿s/KPI¿s/OLA¿s. Ensure that all in the delivery team, including self, are constantly thinking of ways to do things faster, better or in a more economic manner. Lead and ensure project is in compliance with Software Quality Processes and within timelines. Review functional and technical specification documents. Serve as the single point of contact for the team to the project stakeholders. Promote team work, motivate, mentor and develop subordinates. Provide application production support as per process/RACI (Responsible, Accountable, Consulted and Informed) Matrix.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/tech-lead-at-tech-mahindra-4244575151?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Network Lead",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nNetwork Engineer ¿ L2/L3 ¿ India (Pune and Hyd) (24x7 support Shift) with Work from office. Primary Skills: Networking concepts with NAC deployment experience, CCNA, CCNP. Experience: 7 to 10 years of total work experience. Required Skills: Strong experience on Routing and Switching, BGP & Cisco ASR, Juniper Routers Strong troubleshooting techniques on Networking technology Managed large enterprise WAN, LAN and WLAN networks. Hands on experience with NAC deployment. Expertise in multi vendor L2/L3 switches. In depth knowledge of LAN/WAN support for data networks at Access, Aggregation, and Core network including redundancy protocols such as HSRP, VRRP etc. In depth knowledge of WLAN technologies ¿ Wireless controller & access points. Thorough understanding of modern service provider TCP/IP data networks including MPLS, OSPF, BGP4, STP, RSTP, VTP, VLAN. Familiarity with MPLS & WAN communication technology like Internet VPN, SSL VPN. Good knowledge and hands on experience with routing\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/network-lead-at-tech-mahindra-4255098714?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Associate Business Consultant",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Consulting, Information Technology, and Sales",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nRole:- SF SF / Success Factors – Employee Central and Time Management Minimum of 8+ years SAP SF consulting experience Must have Active certification in Employee Central and Time Management. Good knowledge of HR processes across EC modules and Time Management Experiences working in an onsite / offshore environment Must have involved at least 3-4 SAP Implementation and 2 Rollout Leading customer workshops for the SF Rollout /Implementation and optimization project Strong relationship management and stakeholder engagement skills with solution-oriented approaches and strong collaboration with HR colleagues and business stakeholders Ability to work in multiple modules at the same time. Able to work independently and with others, self-directed, take initiative to solve problems and overcome roadblocks. Results-oriented Must have worked on MDF, foundation objects, associations, Business rules and workflows Experience in preparation and execution of Test Scenarios Test scripts and Cutover activities, Good knowledge of system configuration in Solution Design Configuration Workbook, Good communication.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/associate-business-consultant-at-tech-mahindra-4240916780?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Sr. Network Engineer- Cisco Nexus and ACI",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Key Responsibilities:\n\n• Design, implement, and manage enterprise-level LAN/WAN networks including routing, switching, and load balancing.\n\n• Plan and implement Cisco Nexus 5K/7K/9K switching infrastructure in data center environments.\n\n• Hands-on experience implementing and troubleshooting Cisco ACI fabric, including tenant, application profiles, bridge domains, contracts, and policies.\n\n• Maintain high availability and performance in network infrastructure supporting critical applications.\n\n• Collaborate with cross-functional teams for network integration, migrations, and optimization tasks.\n\n• Provide L3 support and root cause analysis for complex network issues.\n\n• Document designs, processes, and procedures for knowledge sharing and future reference.\n\n\n\n\nMust-Have Skills:\n\n• Deep understanding and hands-on experience in:\n\n• Cisco ACI architecture and implementation\n\n• Cisco Nexus switches (5K/7K/9K series)\n\n• LAN/WAN technologies including routing protocols (OSPF, BGP, EIGRP)\n\n• VLAN, STP, VPC, HSRP, VRF, QoS\n\n• Multicast, MPLS, IPsec, and VPNs\n\n• Experience with network monitoring tools like SolarWinds, ThousandEyes, or equivalent.\n\n• Understanding of virtualization and integration with VMware/Hyper-V environments.\n\n• Basic scripting (Python/Shell) for automation is a plus.\n\n\n\n\nPreferred Certifications:\n\n• CCNP Data Center or CCNP Enterprise\n\n• Cisco ACI Specialist\n\n• CCIE (nice to have)",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-network-engineer-cisco-nexus-and-aci-at-tech-mahindra-4246037054?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "Solution Designer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n\n * Proven experience as a Frontend Developer with a deep understanding of Angular and its ecosystem. - Proficient in JavaScript, TypeScript, HTML5, and CSS3. - Strong experience with unit testing, particularly with TDD methodologies (Jasmine/Karma, Jest, etc.). - Solid understanding of Git and version control best practices in a complex collaborative team environment. - Leadership experience: comfortable mentoring developers and encouraging a culture of continuous improvement. - Strong problem-solving and analytical skills, with the ability to translate business needs into technical solutions. - Excellent verbal and written communication skills, especially in translating complex technical solutions for non-technical stakeholders. - Experience in an Agile development environment, contributing to iterative and incremental development processes.\n   \n   ",
   "jobUrl": "https://in.linkedin.com/jobs/view/solution-designer-at-tech-mahindra-4244574152?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Salesforce Automation Tester",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Quality Assurance",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nPAN INDIA OPEN JD:\n\n\n * Total exp 6-8yrs + yrs and 3-5 yrs Strong hands on in Selenium Java Automation Testing\n * Provide oversight and technical guidance to a team of quality engineers and analysts to ensure that all products are of high quality. Roles and Responsibilities:\n * Lead QE activities associated with a product and release train Ensure quality delivery and metrics to gauge progress against quality goals (test coverage)\n * Understand how components and interfaces work together and develop QE approaches to fit overall architecture\n * Drive the maturity of QE (to enterprise state, fostering innovation, predictability, and creativity)\n * Drive test architecture, best practices, frameworks, tools and systems\n * Develop quality and release standards, create and execute test plans (functional, regression, validation), analyze test results, provide release readiness metrics (test coverage)\n * Establish resource plans and coordinate QE resources Triage issues during the release process\n * Establish release activity policies and make decisions against those policies\n * Act as a change agent to improve quality and agility.\n * Voice of the customer\n * Drives release level testing plans for each team\n   \n   ",
   "jobUrl": "https://in.linkedin.com/jobs/view/salesforce-automation-tester-at-tech-mahindra-4210678832?trk=public_jobs_topcard-title",
   "postedTime": "2 months ago"
 },
 {
   "title": "AI Engineer",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nLocation : Bangalore Required: Bachelor's or Master¿s degree in Computer Science, Engineering, Data Science, or a related field. 5+ years of experience with cloud platforms, preferably GCP. Hands on experience with Vertex AI, Generative AI Studio, Gemini APIs, and other GCP GenAI tools. Strong programming skills in Python and experience with ML libraries such as TensorFlow, PyTorch, or Hugging Face Transformers. Experience building and deploying machine learning models in production. Familiarity with MLOps and CI/CD for AI/ML applications. Experience with prompt engineering, model evaluation, and hallucination mitigation techniques Preferred: Google Cloud certifications (e.g., Professional Machine Learning Engineer, Professional Cloud Architect).\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/ai-engineer-at-tech-mahindra-4244569606?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Architect",
   "companyName": "Tech Mahindra",
   "location": "Chennai, Tamil Nadu, India",
   "experienceLevel": "Associate",
   "contractType": "Full-time",
   "workType": "Information Technology, Manufacturing, and Analyst",
   "sector": "IT Services and IT Consulting, Architecture and Planning, and Manufacturing",
   "description": "A CloudPak Architect:\n\nKey Responsibilities\n\n * Cloud Strategy & Design: Developing scalable and secure cloud architectures using IBM CloudPak.\n * Integration & Migration: Ensuring seamless integration with existing IT infrastructure and overseeing cloud migrations.\n * Security & Compliance: Implementing security best practices and ensuring regulatory compliance.\n * Performance Optimization: Monitoring and optimizing cloud-based applications for efficiency.\n * Collaboration & Leadership: Working with developers, engineers, and IT teams to enhance cloud solutions.\n\nRequired Skills\n\n * Expertise in IBM CloudPak technologies.\n * Strong knowledge of Kubernetes, containerization, and microservices.\n * Experience with cloud platforms like AWS, Azure, or IBM Cloud.\n * Understanding of networking, security, and automation.\n * Proficiency in scripting languages like Python or Bash.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/architect-at-tech-mahindra-4241854445?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Associate Tech Specialist",
   "companyName": "Tech Mahindra",
   "location": "Noida, Uttar Pradesh, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nHands-on experience in Axway B2bi and Axway Mapping Services. Design, develop and implement B2B integrations using Axway B2Bi platform. Troubleshoot and resolve B2B integration issues. Proficient in end-to-end Trading Partner onboarding using AS2, FTP, HTTPS, SFTP, OFTP2 and VAN. Well versed on designing, developing, modifying and debugging various map types include (EDI to [XML, Positional, IDOC, CSV]) & vice versa; XML to Positional). Expert on EDI standards such as EDIFACT, ANSI X12, XML standards and Supply Chain Process Knowledge of Business Processes to address EDI needs Knowledge on Administration activity and scripting language is a plus Responsibilities Work on user support and guidance, problem ticket analysis and resolution. Tracks completions and reports closures by due dates or dates assigned by Ford. Support in providing resolution for production incidents. Support in supplier onboarding, providing end to end support coordinating with suppliers and internal application in establishing connectivity and testing. Resolve tickets on supplier challenges with password updates and assist suppliers in completion of password policy implementation. Coordinate with SFTP suppliers in obtaining information on SHA algorithm and provide support with SSH key configuration and connectivity testing for suppliers making the SSH key change. Participates in meetings with Ford areas upon request.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/associate-tech-specialist-at-tech-mahindra-4219123113?trk=public_jobs_topcard-title",
   "postedTime": "2 months ago"
 },
 {
   "title": "Associate Team Lead",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n¿ Custom SAP Development: Designing and developing custom SAP solutions to meet business requirements, using programming languages such as ABAP (Advanced Business Application Programming) or SAPUI5. ¿ Integration: Integrating SAP with other systems and applications within the organization's IT landscape. Working with various integration technologies and platforms to ensure seamless data exchange and process workflows. ¿ System Configuration and Customization: Configuring SAP modules according to business needs. ¿ Data Management and Migration: Managing SAP data and ensuring its accuracy and integrity. ¿ Performance Tuning: Optimizing SAP applications and systems for better performance.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/associate-team-lead-at-tech-mahindra-4240921078?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Tech Lead",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nNetwork Design ¿ Architecture & design discussion with Customer together with Nokia team. ¿ Document and identify and perform analysis of all networking technologies. ¿ Prepare research plans and documented projects for all LAN and WAN based methods. ¿ Identify and resolve all technical issues in matter of formulation and creation of strategies. ¿ Develop multi functional technology and multi vendor network based action plans. ¿ Prepare and implement three tier upgrade program and resolve all network issues. ¿ Coordinate Dedicated design document delivery (HLD/LLD/Migration Strategy) to project (internal repository) ¿ Handover Customer approved HLD/LLD and golden configs to Integration Engineer(s)/MoP Creators. ¿ Support any design issues during deployment ¿ Work with Support teams (TAC/TEC) for any post deployment issues in identifying Design vs product issues ¿ SA will be available on call for any integration/migration window as the second point of technical escalation and to help debug an issue before escalating to TAC/TEC. Network Integration ¿ Customer Network plan, technical inputs & activities schedule to be required prior to MOP preparation ¿ Responsible for technical delivery of node integration in network ¿ Prepare MOP to be executed during activity. ¿ Validate MOP generated from tools. ¿ Share MOP with Field team for upload during power on ¿ Engage in troubleshooting during node integration ¿ Coordinate with all stakeholders to make link/services up. ¿ Perform pre AT of node and ensure all configuration and health status is as per requirement. Coordinate with stakeholder to make the node visible in NMS/OSS/Servers. ¿ Participate in AT and handover of node. ¿ Collect logs and upload in folder/mail. ¿ Troubleshoot with TAC team in case of any product issue. Migration MOP preparation ¿ Customer network plan, technical inputs & activities schedule to be required prior the MOP preparation. ¿ Responsible for technical delivery of each Migration ¿ Ensures Process and Procedures are correctly carried out during MOP preparation ¿ Network assessment ¿ Prepare MOP based on network topology and network services as per HLD/LLD. ¿ Validate manual or tool (if available) generated MOP in LAB/Virtual router. Pre post checks needs to be done in LabAvailable for on call support pre/during execution for MOP clarification. ¿ Support execution team in case of any issue in MOP and correction on immediate basis. ¿ Before onboarding resources, Nokia will engage SME for knowledge transfer to Supplier. Migration execution ¿ Responsible for technical delivery of each Migration ¿ Makes Decisions during Migration Window ¿ Ensures Process and Procedures are correctly carried out during execution ¿ Defines migration strategy with procedural steps, priorities, E2E network impact and methodology. ¿ Go through the MOP before execution and seek for MOP clarification (if any). ¿ Executes configuration changes based on approved MoP ¿ Report activity Status in specified format to Nokia team and customer. ¿ Ensure post migration stability by proactively checking traffic trend, system logs, port statistics and sending hourly report to concern stack holders. ¿ Performs troubleshooting as required. ¿ Initiate HO for host swap node migration and assure to get HO declared within define time period. ¿ Collect pre check, during activity and post check log ¿ Troubleshoot with TAC team in case of any product/configuration issue. ¿ Follow protocol in case of any network outage caused due to changes performed. Network Upgra\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/tech-lead-at-tech-mahindra-4253141291?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Indian Direct Tax",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Accounting/Auditing",
   "sector": "IT Services and IT Consulting",
   "description": "CA with 5 to 8 years of exp in India Direct Tax(Income tax)\n\nHandling TDS, withholding tax obligations\n\nCorporate tax return preparation, Tax computation, assessments, filing of appeal\n\nTax audits, tax provision working etc",
   "jobUrl": "https://in.linkedin.com/jobs/view/indian-direct-tax-at-tech-mahindra-4249932633?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Sr. Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Mumbai Metropolitan Region",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n¿ Providing L1/L2/L3 support in dynatrace all activities. ¿ End2End knowledge on dynatrace implementation. ¿ At least one PoC should have hands on experience. ¿ Should have strong in any one of the cloud implementations. ¿ Expertise in Configure the Process and Service detection rules. ¿ Easy to adapt new configurations based on the customer requirements. ¿ Ability to understand and map key problem areas basis the explanation given by the customer. ¿ Good to have dynatrace certification. ¿ Should have strong knowledge in all dynatrace services and functionalities. ¿ Expertise in problem solving within the deadlines without impact to the customer. ¿ Expertise in raising support tickets and follow up's, and connecting with dynatrace supporting people. ¿ Always fulfill the customer requirements. ¿ Articulate how APM will help the customer transform his current approach of problem solving. ¿ Have excellent oral and written communication skills, be a team player. ¿ Application architecture and Business impact of downtime. ¿ Preparing the monthly shift roaster and manage the team members. ¿ Dynatrace integrations to any ITSM tool. ¿ Knowledge in Synthetic Monitoring Concept and implementation. ¿ Experience in performing application performance analysis. ¿ Strong knowledge on ITIL processes like Incident, Problem and Change Management. ¿ Strong knowledge on UNIX commands.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-software-engineer-at-tech-mahindra-4251489932?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "Pod Lead",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Associate",
   "contractType": "Full-time",
   "workType": "Customer Service",
   "sector": "IT Services and IT Consulting",
   "description": "Tech Mahindra is hiring for the role of POD Lead with minimum 1 year of experience for Hi Tech City Hyderabad. The requirements are\n\n\n\n\n\n\n\n\n\n\nIf Interested share your CVs with below mentioned details to SS00833152@techmahindra.com or WhatsApp your CVs to 8092538712\n\nExperience-\n\nCurrent CTC\n\nExpected CTC\n\nNotice period",
   "jobUrl": "https://in.linkedin.com/jobs/view/pod-lead-at-tech-mahindra-4250348040?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Sr. Test Engineer",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nSAP QA Analyst (SAP Tester ) This job contributes to REI¿s success by supporting the planning, design and execution of SAP system testing on complex applications. Works collaboratively within the SAP FA¿s and ABAP Developers, and business partners to execute and validate test cases based upon system requirements. Leads testing efforts that carry out procedures to ensure that all information systems, products and services meet minimum organization standards. Coordinates testing of SAP to ensure proper operation and freedom from defects. Reports progress on test phase execution to management. Devises improvements to current procedures and builds models of possible future configurations. Performs workflow analysis and implements quality improvements Your Planning & Navigating Requirements:\n\n\n * Develop test strategies, test plans, test cases, test scripts and test reports from SAP Enhancements/Projects\n * Perform testing on SAP and reporting systems\n * Validate user expectations are achieved during the testing process\n * Review user requirements, Functional/technical specification documents to ensure that requirements are testable\n * Document and monitor defects through the resolution process\n * Communicate test and defect status to project teams and management\n * Receive work assignments, context, and guidance. Provide status updates Daily\n * Collaborate to develop requirements for new or changed business processes\n * Project Manager Provide status updates\n * Business Analyst Collaborate on projects and enhancements The 10+ Essentials (the minimum knowledge, skills and abilities necessary to perform the job)\n * Required o Years of experience 3 5 yrs o Familiarity with Testing tools, specifically JIRA o Bachelor¿s degree in related field or equivalent work experience 3 5 yrs o Knowledge of retail business processes o Ability to identify and prioritize project testing needs o Understanding of the Software Development Lifecycle o Understanding of IT development methodologies (Agile, Waterfall) o Excellent verbal and written communication skills. o Actively participates and collaborates with others on one's own team and across REI for the achievement of business goals. o Flexible in one's viewpoints and positions in order to support the direction taken by others at REI. o Uses business knowledge, innovative thinking, and sound judgment in the solution of problems or the pursuit of business opportunities. o Consolidates information from various sources including feedback from others to reach sound decisions o Considers the ultimate impact of decisions and actions on internal and external customers o Works smart by setting effective work goals, establishing priorities, and planning well in order to produce quality work o Executes effectively by using resources efficiently, meeting deadlines, and keeping others informed of work plans and progress toward goals o Clearly conveys and accurately receives information by a variety of methods and in various situations o Builds rapport with all kinds of people inside and outside the organization o Acts upon opportunities and involves and influences others in the accomplishment of worthwhile organizational goals\n   \n   ",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-test-engineer-at-tech-mahindra-4219664883?trk=public_jobs_topcard-title",
   "postedTime": "2 months ago"
 },
 {
   "title": "Sr. Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Chennai, Tamil Nadu, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n¿ Design and Develop Automation Framework for tools like Cypress, Selenium Web Driver, Cucumber, Playwright, etc. ¿ Technical Consulting with product teams on test automation needs, strategy & implementation guidelines. ¿ Support on test automation tools & frameworks for Product team. ¿ Developing End to End Test scripts using Automation tools and Frameworks and execute\\maintain scripts for each release.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-software-engineer-at-tech-mahindra-4240108240?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Manager Direct Tax",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Finance",
   "sector": "IT Services and IT Consulting",
   "description": "Tax Provisions, computations and Tax Return filing for all Techm India entities\n\n2. Handling Statutory Audit and any Internal Audit queries\n\n3. Responsible for Tax Audit and finalization of Tax returns\n\n4. Handling Assessments at AO/CIT(A) level for all tax related matters\n\n5. Preparation of paperbook for ITAT matters and supporting counsel for ITAT matters\n\n6. Follow up with Income Tax Department on various matters including pending refunds\n\n7. Tax Advisory for internal stakeholders\n\n8. Handling of Assessments for Satyam post merger\n\n\n\n\nDirect Tax Manager JD\n\nCA with 15+ years experience\n\nPune Location",
   "jobUrl": "https://in.linkedin.com/jobs/view/manager-direct-tax-at-tech-mahindra-4247923177?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "Tech Lead",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nTo ensure successful initiation, planning, execution, control and completion of the project by guiding team members on technical aspects, conducting reviews of technical documents and artefacts. Lead project development, production support and maintenance activities. Fill and ensure timesheets are completed, as is the invoicing process, on or before the deadline. Lead the customer interface for the project on an everyday basis, proactively addressing any issues before they are escalated. Create functional and technical specification documents. Track open tickets/ incidents in queue and allocate tickets to resources and ensure that the tickets are closed within the deadlines. Ensure analysts adhere to SLA¿s/KPI¿s/OLA¿s. Ensure that all in the delivery team, including self, are constantly thinking of ways to do things faster, better or in a more economic manner. Lead and ensure project is in compliance with Software Quality Processes and within timelines. Review functional and technical specification documents. Serve as the single point of contact for the team to the project stakeholders. Promote team work, motivate, mentor and develop subordinates. Provide application production support as per process/RACI (Responsible, Accountable, Consulted and Informed) Matrix.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/tech-lead-at-tech-mahindra-4250891545?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "Architect",
   "companyName": "Tech Mahindra",
   "location": "Chennai, Tamil Nadu, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Consulting, Design, and Information Technology",
   "sector": "IT Services and IT Consulting, Architecture and Planning, and IT System Data Services",
   "description": "Google Cloud Platform (GCP) Architect:\n\nKey Responsibilities:\n\n * Design and architect end-to-end solutions on Google Cloud Platform (GCP) for enterprise applications and workloads\n * Lead cloud strategy discussions and drive architectural decisions aligned with business goals\n * Define and implement best practices for cloud architecture, security, scalability, and performance\n * Provide technical leadership in GCP services such as Compute Engine, Kubernetes Engine (GKE), BigQuery, Cloud Functions, VPC, IAM, and Cloud Storage\n * Design and oversee Infrastructure as Code (IaC) using tools like Terraform or Deployment Manager\n * Drive cloud adoption and modernization initiatives, including on-prem to GCP migrations\n * Conduct cloud assessments and provide recommendations for optimization and cost-efficiency\n * Collaborate with development, DevOps, security, and data teams to ensure cohesive architecture\n * Stay updated on new GCP features and emerging technologies and integrate them into the architecture roadmap\n * Mentor and guide junior cloud engineers and architects\n\nRequired Skills and Qualifications:\n\n * Bachelor’s or Master’s degree in Computer Science, Information Technology, or related field\n * 10+ years of overall IT experience with 3+ years specifically in designing cloud solutions on GCP\n * In-depth understanding of cloud architecture principles, including microservices, serverless computing, container orchestration, and distributed systems\n * Hands-on expertise in GCP services: GKE, Cloud Run, Pub/Sub, BigQuery, Cloud Functions, Cloud SQL, Firestore, etc.\n * Strong knowledge of networking (VPCs, firewalls, load balancing) and cloud security (IAM, encryption, identity management)\n * Experience with DevOps and automation tools (CI/CD, Jenkins, GitLab CI, Cloud Build)\n * Proven experience in designing highly available and disaster-resilient cloud solutions\n * GCP Professional Cloud Architect Certification (or equivalent) is required\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/architect-at-tech-mahindra-4241854355?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Tech Lead",
   "companyName": "Tech Mahindra",
   "location": "Chennai, Tamil Nadu, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nTo ensure successful initiation, planning, execution, control and completion of the project by guiding team members on technical aspects, conducting reviews of technical documents and artefacts. Lead project development, production support and maintenance activities. Fill and ensure timesheets are completed, as is the invoicing process, on or before the deadline. Lead the customer interface for the project on an everyday basis, proactively addressing any issues before they are escalated. Create functional and technical specification documents. Track open tickets/ incidents in queue and allocate tickets to resources and ensure that the tickets are closed within the deadlines. Ensure analysts adhere to SLA¿s/KPI¿s/OLA¿s. Ensure that all in the delivery team, including self, are constantly thinking of ways to do things faster, better or in a more economic manner. Lead and ensure project is in compliance with Software Quality Processes and within timelines. Review functional and technical specification documents. Serve as the single point of contact for the team to the project stakeholders. Promote team work, motivate, mentor and develop subordinates. Provide application production support as per process/RACI (Responsible, Accountable, Consulted and Informed) Matrix.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/tech-lead-at-tech-mahindra-4255097752?trk=public_jobs_topcard-title",
   "postedTime": "1 week ago"
 },
 {
   "title": "Model Governance Analyst",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology, Project Management, and Analyst",
   "sector": "IT Services and IT Consulting",
   "description": "Role purpose\n\nCybersecurity Science and Analytics empowers Cybersecurity in protecting the bank by leveraging data and innovative capabilities to create effective and initiative-taking security measures, as well as enabling data driven business decisions.\n\nWe are seeking a highly motivated Model Governance Analyst to join our Advanced Projects team. In this role, you will play a key role in supporting the oversight and compliance of AI/ML models used across the Cyber security team. The Model governance analyst will form part of CSA’s Advanced Projects team, joining a global team of cybersecurity specialists, data scientists, and software engineers from diverse backgrounds to support and streamline Model governance within Cyber and for the bank. The ideal candidate will possess a good attitude, an eagerness to learn and the ability to work collaboratively in a fast-paced environment.\n\n\n\n\nThe position is a semi-technical role requiring a knowledge of Cyber/AI governance, data analysis, reporting and agile/project management skills with an opportunity to interact with stakeholders and solve problems within AI/Cybersecurity.\n\n\n\n\nPrincipal Accountabilities and Responsibilities:\n\n\n\n\nModel Governance\n\n * Process Model governance tickets through from assessment to completion.\n * Review Model use cases and check they are in line with governance requirements.\n * Support the governance lifecycle of all models, including inventory management, validation tracking, and change controls.\n * Assist in the continuous improvement of model governance policies and procedures.\n * Ensure data quality and integrity through effective model governance practices.\n * Assist in preparing reporting, presentations, and documentation to support regulatory and internal monitoring, governance processes.\n * Maintain a centralised and up-to-date model inventory that tracks all models, tools, and end-user applications across Cybersecurity.\n * Ensure accurate and complete documentation is maintained for each model, including model development documentation, validation reports, change logs.\n * Identify and develop process improvements opportunities by automating where applicable.\n * Provide regular reporting and analysis to senior management on model risk governance activities.\n\n\n\n\nAgile Project Management: Development\n\n * Prepare clear, stakeholder facing communications in line with team standards of clarity, reference and effectiveness. Document requirements, analyse findings, and recommendations. Assist in preparing reporting, presentations and documentation to support regulatory and internal monitoring, governance processes.\n * Manage workflow timelines, track progress, and ensure timely delivery of milestones.\n * Provide the Model oversight chair with administrative support and help in managing task backlog.\n\n\n\n\nStakeholder Collaboration\n\n * Prioritise and provide same-working day accurate responses to ad-hoc issues and requests.\n * Communicate and collaborate closely with colleagues from a wide range of backgrounds (cybersecurity/AI/risk/compliance teams), providing regular updates on AI activity status and addressing any issues promptly.\n * Build and maintain positive relationships with internal collaborators.\n\n\n\n\nContinuous learning and Improvement:\n\n * Contribute to continuous improvement of processes and methodologies.\n * Identify and develop processes improvements opportunities by automating where applicable.\n * Analyse extensive datasets to identify patterns and trends to uncover trends, patterns, and insights that inform decisions.\n\n\n\n\nSkills and experience\n\n * 5-8 years of experience in financial services, AI/ML risk management or model governance, Regulatory compliance or Technology\n * Bachelor’s degree in any Science, Technology, Engineering, or field accompanied with data, technology and/or programming experience also considered.\n * Applicants without a Bachelor’s degree will be considered if they have demonstrable career experience within one or more of the required areas and/or have relevant industry certifications in Data or Cybersecurity.\n * CSA are a supportive team who welcome candidates from diverse skills and educational backgrounds. Thus, candidates with transferrable skills gained through other technology background will also be considered.\n * Knowledge of scripting languages such as Python, Java, C#, or similar (Nice to have)\n * Familiarity and Understanding of Cyber/AI vocabulary and technologies.\n * Knowledge of Agile project management tools (e.g., JIRA)\n * Positive attitude, strong work ethic and passion for learning\n * Good organisation skills\n * Effective communication and people skills\n * Positive team player working as part of a large programme.\n\n\n\n\nGovernance and Committee Memberships\n\nProgramme boards; daily/weekly management reporting and governance meetings.\n\n\n\n\nLocation: Hyderabad/Pune\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/model-governance-analyst-at-tech-mahindra-4256645932?trk=public_jobs_topcard-title",
   "postedTime": "8 hours ago"
 },
 {
   "title": "Tech Lead",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nHis/her main objective is to own the OMP support at Bekaert and he/she is the point of contact for OMP support ¿ He/she is responsible to make sure that tickets are picked up, clarified and solved. ¿ When a ticket is logged he/she investigates if a bug in OMP, if master data issue, issue in sourcing system (mainly SAP) or that user lacks knowledge o If it is a bug in OMP then he/she logs a ticket at OMP and he does a follow up with OMP to have it resolved o If it is an issue in non OMP system then he/she logs a Bekaert ticket and he does a follow up with the respective teams o If it is a master data issue or lack of knowledge he/she follows up with the end user o If another kind of issue, he/she picks it up and tries to find to a solution and does follow up ¿ At closure of the ticket , he/she classifies the ticket so that reporting can be done on it ¿ He/she monitors the OMP dispatcher and checks error logs and creates incidents on these errors or he/she contacts the business to have them solved ¿ As he/she is the first OMP support person at Bekaert , he/she helps shaping an OMP support way of working and methodology ¿ He/she plans and owns a bi weekly meeting with business and Bekaert OMP Business analyst to show the overview of the current open incidents and discuss with business priorities and next steps ¿ He/she plans and owns a monthly meeting with the Bekaert product owner to give an overview of the service level: Closed tickets, open tickets, duration of tickets, classification of tickets ¿ As in the beginning there will not be enough work on support only, he/she will be also involved in projects to help on o Configuration o Testing o Master data setup o Training ¿ As the OMP support team will grow in the future, this person will also become the OMP support responsible leading the team of new collegues. This means making sure that new collegues are onboarded, get the correct training and make sure they live up to the expectations of Bekaert and coach them were needed ¿ Once we are moving to a continuous improvements modus , the person will be involved in testing and follow up of the improvements ¿ In the future OMP support person can also be involved to solve Continuous improvement requests themselves. This will be in the area of the look and feel : reports for example From behavior point of view i am looking at a person that is ¿ Independent ¿ Shows ownership ¿ Proactive ¿ has a critical mindset ¿ is taking initiative\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/tech-lead-at-tech-mahindra-4242832551?trk=public_jobs_topcard-title",
   "postedTime": "4 weeks ago"
 },
 {
   "title": "Tech Lead",
   "companyName": "Tech Mahindra",
   "location": "Chennai, Tamil Nadu, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nTo ensure successful initiation, planning, execution, control and completion of the project by guiding team members on technical aspects, conducting reviews of technical documents and artefacts. Lead project development, production support and maintenance activities. Fill and ensure timesheets are completed, as is the invoicing process, on or before the deadline. Lead the customer interface for the project on an everyday basis, proactively addressing any issues before they are escalated. Create functional and technical specification documents. Track open tickets/ incidents in queue and allocate tickets to resources and ensure that the tickets are closed within the deadlines. Ensure analysts adhere to SLA¿s/KPI¿s/OLA¿s. Ensure that all in the delivery team, including self, are constantly thinking of ways to do things faster, better or in a more economic manner. Lead and ensure project is in compliance with Software Quality Processes and within timelines. Review functional and technical specification documents. Serve as the single point of contact for the team to the project stakeholders. Promote team work, motivate, mentor and develop subordinates. Provide application production support as per process/RACI (Responsible, Accountable, Consulted and Informed) Matrix.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/tech-lead-at-tech-mahindra-4245579151?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 },
 {
   "title": "Sr. Security Analyst",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nStrong Identity & Access Management Domain Experience\n\n\n * Investigates, analyzes, diagnoses, and recovers from Oracle Identity Manager (OIM) and Oracle Access Manager related Incidents, performs Root Cause Analysis, and executes the standard Problem/incident/change process. Experienced in developing OIM 11g R2 / 12c plugins and event handlers, for enhancing OIM functionality Support Access Provisioning and certification processes to ensure regulatory compliance and operational efficiency. In depth LDAP knowledge (AD preferred)\n * Linux system administration, database administration. Working knowledge of SQL on Oracle Database 11g Experienced in performing OIM package/Patch deployment, T2P migration of packages.\n * \n * Provides maintenance support of the EIAM request catalog, roles, and rules. Hands on experience in core java and concepts for OIM development and enhancements.\n   \n   ",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-security-analyst-at-tech-mahindra-4231371224?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Sr. DBA",
   "companyName": "Tech Mahindra",
   "location": "Mumbai Metropolitan Region",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\n¿ Resolving User related queries in Production and Test Databases. ¿ As per client request creating new users and assigning profiles in production databases. ¿ User management and maintenance of all database users like granting a subset of privileges as per client¿s policy. ¿ Logical backup using Export Import and Data Pump utility as per user request. ¿ Database bug patching on requirement ¿ Creating Sql tuning sets and sql tuning advisory reports using OEM 19C for Improving performance of the database. ¿ Executing weekly analyzer on database for performance improvement. ¿ Monthly purging activity to gain database level space improvement ¿ Archival activity for performance improvement. ¿ Performance monitoring, Database installation and configuration ¿ Schedule RMAN backup and monitor RMAN status of all production databases. ¿ Interface proactively with other Infrastructure support teams such as UNIX, Windows, Network, Storage, Monitoring etc ¿ Document issues and associated resolutions to problems ¿ Prepare documentation and presentation of progress reports to customers ¿ Conduct user¿s, customer¿s and Team¿s training ¿ Guide/Mentor the team members on technical problems which cannot be resolved at their level ¿ Ensure that Systems, Organization processes, & Unit practices adhere to Organization policies\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-dba-at-tech-mahindra-4243560132?trk=public_jobs_topcard-title",
   "postedTime": "4 weeks ago"
 },
 {
   "title": "Sr. Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Bengaluru, Karnataka, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nReactJS (Client Side Framework), HTML5, CSS3, Responsive Web Designs, Web API, C# and related Microsoft .NET technology stack including best practices and design patterns. You will code review team contributions, as well as guide them on best practices.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-software-engineer-at-tech-mahindra-4242836111?trk=public_jobs_topcard-title",
   "postedTime": "4 weeks ago"
 },
 {
   "title": "Network Lead",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nJob Description: NOC Zscaler engineer Duties and Responsibilities ¿ Provide SME level of Network and Service Assurance support for core to edge security protocols on Zscaler platform. ¿ Troubleshooting the network and service issues while adhering to SLA/KPIs and ensure target SLA levels are met for each ticket. ¿ Troubleshooting of enterprise and cloud based Proxy and VPN access ¿ Troubleshooting on Site to Site and Remote Site VPN¿s , ZIA and ZDX ¿ Working directly with equipment vendors, OEMs, Field Support Staff. ¿ Analysis for root cause determination of issues including recommendations for improvements. Experience & Band ¿ L3: BE/BTech 6+ year , U4 band Minimum Job Entry Requirements ¿ Good technical knowledge Zscaler (ZIA and ZPA) experience will be preferred ¿ Troubleshooting experience on Paulo Alto Firewall, Zone Based Firewall, and Zscaler (ZIA and ZPA) ¿ Troubleshooting experience on Cloud Based Proxy ¿ Troubleshooting experience on Content filtering and deep packet inspection ¿ Troubleshooting experience on DDOS prevention ¿ Enterprise Security Troubleshooting Experience ¿ Data center Security Troubleshooting Experience ¿ Strong skills on MS Office for reports and RCA making. ¿ Strong analytical skills to resolve problems. ¿ Strong oral and written communication skills to coordinate repair efforts and prepare reports. ¿ Strong interpersonal skills to coordinate efforts effectively between multiple groups. ¿ Ability to manage multiple tasks in a fast paced environment. ¿ Zscaler (ZIA and ZPA) experience will be preferred. Desired Certification ¿ ZPA Professional ¿ ZIA Professional ¿ ZDX Administrator Location: Pune/Bangalore\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/network-lead-at-tech-mahindra-4252024706?trk=public_jobs_topcard-title",
   "postedTime": "2 weeks ago"
 },
 {
   "title": "Sr. Software Engineer",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nData Extract from IBM File Gateway and Control Center. ¿ Last login by Producer/Consumer ¿ Internal pulls (scheduled processes) ¿ Multiple Sub directory Producer/Consumer ¿ Send to Email flows, consumers etc. ¿ Shared Producers ¿ Mainframe Unique Files ¿ Master IDs ¿ Connect Direct ¿ Inbound FTP uploads ¿ Outbound FTP ¿ Routing to test/pilot locations ¿ Extensive Routing Rule ¿ Shared Consumers across Producers ¿ CC specific: FTP inbound & outbound (monitor FTP adapter traffic and report) Position is short term and hence I would prefer internal candidate rather going for external. Client is looking for someone with good knowledge on these tool, someone who can analyze the current setup, extract the configurations via automation and put some suggestion for platform migration. Need candidate with Operational experience on the IBM storage tool. Please note this is old tech you have to search accordingly.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-software-engineer-at-tech-mahindra-4257994740?trk=public_jobs_topcard-title",
   "postedTime": "1 day ago"
 },
 {
   "title": "GenAI Tester",
   "companyName": "Tech Mahindra",
   "location": "Pune, Maharashtra, India",
   "experienceLevel": "Entry level",
   "contractType": "Full-time",
   "workType": "Engineering and Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nProfessional skilled in evaluating and assessing the performance, accuracy, and safety of AI systems that generate content autonomously. They ensure these systems function as intended and avoid generating undesirable or harmful outputs, including bias, hallucinations, or privacy violations. GenAI testers utilize various techniques, including functional testing, adversarial testing, and bias testing, to identify and address potential issues in AI powered systems. Job Title: GenAI Tester Working Hours: 2 PM to 11 PM IST Experiecne-5+ Yrs. Location-Bangalore/Pune/Hyderabad Job Description: We are seeking a dedicated and detail-oriented GenAI Azure Chatbot Tester to join our team. The ideal candidate will be responsible for ensuring the quality and performance of our Azure-based chatbot solutions. This role requires a strong understanding of AI technologies, excellent problem-solving skills, and the ability to work collaboratively in a fast-paced environment. Key Responsibilities: Testing and Validation: Conduct comprehensive testing of Azure-based chatbot solutions to ensure functionality, performance, and reliability. Develop and execute test cases, scripts, plans, and procedures (manual and automated). Identify, document, and track defects and inconsistencies in chatbot behavior. Perform prompt-based testing to evaluate the chatbot's responses to various user inputs and scenarios. Quality Assurance: Ensure that the chatbot meets all specified requirements and standards. Perform regression testing to verify that new code changes do not adversely affect existing functionalities. Collaborate with developers to resolve issues and improve chatbot performance. User Experience Testing: Evaluate the chatbot's user interface and user experience. Provide feedback on conversational flow, response accuracy, and overall user satisfaction. Suggest improvements to enhance user engagement and interaction. Performance Monitoring: Monitor chatbot performance metrics and analyze data to identify areas for improvement. Conduct load testing to ensure the chatbot can handle high volumes of interactions. Report on performance trends and recommend optimizations. Documentation and Reporting: Maintain detailed documentation of test cases, test results, and defect reports. Prepare and present test reports to stakeholders. Ensure all testing activities are well-documented and traceable. Collaboration and Support: Work closely with cross-functional teams, including developers, product managers, and customer support. Provide support during the deployment and post-deployment phases. Participate in team meetings and contribute to project planning and review sessions. Qualifications: Proven experience in software testing, preferably with AI or chatbot technologies. Strong knowledge of Azure services and tools. Proficiency in test automation tools and frameworks. Excellent analytical and problem-solving skills. Strong communication and collaboration abilities. Ability to work independently and manage multiple tasks simultaneously. Flexibility to work from 2 PM to 11 PM IST. Preferred Skills: Experience with natural language processing (NLP) and machine learning (ML). Familiarity with Agile methodologies. Knowledge of scripting languages such as Python or JavaScript.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/genai-tester-at-tech-mahindra-4235991815?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Asso. Functional Consultant",
   "companyName": "Tech Mahindra",
   "location": "Hyderabad, Telangana, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nSAP Senior/Lead Consultant PS & EPPM SAP PS and EPPM projects with a focus on S/4HANA 2 2 end to end implementation Support in the development of customer specific enhancements Technical project responsibility in consulting and meetings Implementation, optimization and release change projects Technical responsibility in customer projects Leading customer workshops and presentations further training of hard and soft skills Experience in successful SAP S/4HANA implementation or conversion projects, preferably a PS, PPM and/or CPM implementation More than 7 years of experience in SAP EPPM (SAP PPM, SAP CPM and SAP PS) Completed certification in at least one SAP EPPM tool would be a plus High flexibility and willingness to travel To contribute towards project delivery and solution design for a model based, existing domain, with pre defined artifacts with support of experienced mentors. Perform and understand a process assessment/audit for a model based solution with pre defined process artifacts, known domain, less demanding timelines independently. Perform planning and implement Model based solution with new solution requirement/domain, process artifacts partially available and mix of experience/ fresh professionals independently. Contribute to Model based collaterals with new solution requirement/domain, process artifacts partially available and a mix of experienced / fresh professionals independently. Contribute in creation of capability assets independently with pre defined process assets. Participate and contribute in internal knowledge sharing sessions independently contributing to knowledge repository. Participate in internal forums.\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/asso-functional-consultant-at-tech-mahindra-4240914933?trk=public_jobs_topcard-title",
   "postedTime": "1 month ago"
 },
 {
   "title": "Sr. Security Analyst",
   "companyName": "Tech Mahindra",
   "location": "Noida, Uttar Pradesh, India",
   "experienceLevel": "Mid-Senior level",
   "contractType": "Full-time",
   "workType": "Information Technology",
   "sector": "IT Services and IT Consulting",
   "description": "Job Summary\n\nJob Description Designs, tests, and implements Privileged Account Management systems and solutions; security monitoring, tuning and management of IT security systems and applications, incident response, and forensic actions. Provide daily support for CyberArk PIM Suite including Enterprise Password Vault, Privileged Session Manager (PSM), Responsible for Privileged Account Management of Windows, UNIX, Database and Infrastructure accounts using CyberArk Completes routine onboarding & decommissioning requests Troubleshoots operational issues with automated password management, system access. Collaborates with senior team members and vendor support resources to resolve Supports CyberArk Central Policy Manager (CPM) policy management Supports custom plug ins and connectors for CyberArk CPM and PSM Works well in large enterprise with strict change management procedures Interprets, analyzed and applies of corporate security standards and baselines Apply patches and updates to CyberArk components, remediate security advisories and work closely with enterprise stake holders Qualifications Required Qualifications: Bachelor in Technology in Computer Science, Engineering, or an equivalent combination of education or experience. At least 4 years of experience in CyberArk Core PAS Vault infrastructure and component services in a large enterprise. Working knowledge of Microsoft Networking/AD, LDAP, DNS, Firewalls, networking, high availability Responsible for On boarding and Off boarding Privileged accounts as per business requirements. Responsible for managing the user access in Private Ark client. On boarding, Off boarding & modifying the accounts in CyberArk and resetting the password. Managing the built in emergency accounts(root in Linux, Administrators in windows) Creating accounts, safes and customized platforms in CyberArk along with account management operations (includes concept of verification and reconciliation) Creating and Managing Safes, platforms and owners. Able to work, collaborate and openly communicate in a team environment Creating and Managing Safes, platforms and owners. Onboarding accounts in PVWA for various platform (Windows, UNIX, Database, Oracle). Bulk Account Onboarding using password upload utility & Rest API scripts. Performing User Account Administrative Tasks (like creation of user accounts, Resetting Passwords, Unlocking User Accounts, Enabling and Disabling User Accounts, Rename User Accounts and creating user mailboxes. Troubleshooting of noncompliance accounts in CyberArk. Interacting with the client on various issues on the privileged accounts. Troubleshooting user issues 2 factor authentication issues, password reset, user disable, account locked guiding the users to connect the target devices from CyberArk. Involved in the P2, P3 and P4 issues & resolved within the SLA with appropriate resolution steps & performed root cause analysis for the permanent issues. Strong communication skills with the ability to communicate difficult concepts and technical solutions. Certifications: CyberArk level 2 (Defender) certification Additional Skills: Certifications: CyberArk level 3 (Sentry) certification preferred Skilled in scripting (REST, Python and PowerShell preferred) Experience in administering Windows and Unix based systems, databases, network appliances Consulting experience is preferred\n\n",
   "jobUrl": "https://in.linkedin.com/jobs/view/sr-security-analyst-at-tech-mahindra-4244862979?trk=public_jobs_topcard-title",
   "postedTime": "3 weeks ago"
 }
]